ics108.org
#+TITLE: ICS108 NOTES
#+DESCRIPTION: Notes for Java OOP Ics108 course
#+AUTHOR: Airbus5717
#+begin_comment
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup
#+end_comment
#+HTML_HEAD: <link href="extra.css" rel="stylesheet" type="text/css" />
#+LaTeX_HEADER: \usepackage{minted}


#+begin_quote
THIS IS NOT AN ALTERNATIVE TO THE BOOK
#+end_quote

-----
* Chapter 1: Introduction to Java
** Simple Java Program
 
#+NAME: Java simple Program
#+begin_src java
class App {
    public static void main(String[] args) {
        System.out.println("Welcome to Java!");
    }
}
#+end_src

#+RESULTS: Java simple Program

#+begin_quote
Java source files are compiled by Java compiler to bytecode (.class files) then
ran with Java Virtual Machine (JVM)
#+end_quote

+ Class name = App
+ Main method = public static void main (arguments)

  { code in method }
+ Statements = i.e. print statement
  - each statment in java must end with a semicolon (;)
+ Reserved keywords
    - class
    - public
    - static
    - void
    - etc.
+ Comments
  - single line and multiline comments
    #+begin_src java
    // single line comment
    /* multi line
     comment */

    #+end_src
+ Blocks: a group of components of a program
-----
** Programming Style and documentation
+ Appropriate Comments
+ Naming Conventions
+ Proper Identation and spacing lines
+ Block styles
** Programming Errors
+ Syntax Errors
  + Detected by the compiler (i.e. missing semicolon)
+ Runtime Errors
  + Causes the program to abort (i.e. divition by zero)
+ Logic Errors
  + Produces incorrect results (i.e. incorrect logic)
-----
* Chapter 2: Elementry Programming
** Program example:
#+NAME: Compute Circle Area
#+begin_src java
public class App {
    public static void main(String[] args) {
        double radius;
        double area;

        // assign a radius
        radius = 20;

        // Compute Area
        area = Math.pow(radius, 2) * Math.PI;
        // NOTE: Math pow function returns a double

        // Display result
        System.out.println("The Area: " + area + " for radius: " + radius);
    }
}
#+end_src
-----
