ics108.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-07-03 Sat 18:00 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>ICS108 NOTES</title>
<meta name="author" content="Airbus5717" />
<meta name="description" content="Notes for Java OOP Ics108 course" />
<meta name="generator" content="Org Mode" />
<link href="extra.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">ICS108 NOTES</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org93b4093">1. Chapter 1: Introduction to Java</a>
<ul>
<li><a href="#org27a1538">1.1. Simple Java Program</a></li>
<li><a href="#org7b2276a">1.2. Programming Style and documentation</a></li>
<li><a href="#org602f428">1.3. Programming Errors</a></li>
</ul>
</li>
<li><a href="#orga37f009">2. Chapter 2: Elementry Programming</a>
<ul>
<li><a href="#orgb8464af">2.1. Program example:</a></li>
<li><a href="#orgf821ef4">2.2. Reading Input</a></li>
<li><a href="#org8e4f8a2">2.3. Imports</a></li>
<li><a href="#org99ba442">2.4. Identifiers</a></li>
<li><a href="#orgfedaa9a">2.5. Variables</a>
<ul>
<li><a href="#org33b9663">2.5.1. declare variables</a></li>
<li><a href="#org2a482cc">2.5.2. Constant variables</a></li>
</ul>
</li>
<li><a href="#org0dd798f">2.6. Naming Conventions</a>
<ul>
<li><a href="#org6499de6">2.6.1. Variable and method names</a></li>
<li><a href="#orgea89ff0">2.6.2. Class names</a></li>
<li><a href="#org22a3c47">2.6.3. Constant names</a></li>
</ul>
</li>
<li><a href="#org18234e2">2.7. Operators</a>
<ul>
<li><a href="#orgbfdb0c1">2.7.1. useful operations</a></li>
</ul>
</li>
<li><a href="#org3aa9e22">2.8. Data types</a>
<ul>
<li><a href="#orgdac1ed8">2.8.1. Integers</a></li>
<li><a href="#org5dfcda2">2.8.2. Floats and Double</a></li>
<li><a href="#org974df09">2.8.3. Scientific Notation</a></li>
<li><a href="#orgb98bf4b">2.8.4. Chars and Strings</a></li>
<li><a href="#orgb1e9287">2.8.5. other types</a></li>
<li><a href="#orgadc3627">2.8.6. Display Current Time in GMT</a></li>
<li><a href="#org256ab79">2.8.7. Conversion rules</a></li>
<li><a href="#org5c32fe1">2.8.8. Type casting</a></li>
</ul>
</li>
<li><a href="#org9c1592b">2.9. Common Errors and pitfalls</a></li>
</ul>
</li>
<li><a href="#org98cd49b">3. Chapter 3: Selections</a>
<ul>
<li><a href="#orgdf5f9f3">3.1. More Data types</a>
<ul>
<li><a href="#org59c5dd1">3.1.1. boolean type</a></li>
<li><a href="#org961f4a8">3.1.2. boolean (comparasion operators)</a></li>
</ul>
</li>
<li><a href="#orgd8b2aee">3.2. If else statements</a>
<ul>
<li><a href="#org7e07fa7">3.2.1. if</a></li>
<li><a href="#org956ce76">3.2.2. else</a></li>
</ul>
</li>
<li><a href="#org643c1a2">3.3. Logical operators</a></li>
<li><a href="#org6bd2f91">3.4. Switch statement</a></li>
<li><a href="#org3c4048a">3.5. Conditional operators: Ternary</a></li>
<li><a href="#org6a35820">3.6. Operator order (precedence)</a></li>
<li><a href="#org50d24f5">3.7. Debugging</a></li>
</ul>
</li>
<li><a href="#orga4d24c0">4. Chapter 4: Math functions, Chars and Strings</a>
<ul>
<li><a href="#org875d8ae">4.1. Math Class</a>
<ul>
<li><a href="#orga8f57ec">4.1.1. Constants</a></li>
<li><a href="#orge6679b1">4.1.2. Methods</a></li>
</ul>
</li>
<li><a href="#orgf32e7fe">4.2. Characters</a>
<ul>
<li><a href="#orga9c963d">4.2.1. Special Chars</a></li>
<li><a href="#org0aa7a53">4.2.2. Casting between char and ints</a></li>
<li><a href="#org5832c9a">4.2.3. Character Methods</a></li>
</ul>
</li>
<li><a href="#org89ce6f8">4.3. Strings</a>
<ul>
<li><a href="#org23d61ff">4.3.1. String Length</a></li>
<li><a href="#org450844a">4.3.2. specific char from string</a></li>
<li><a href="#org6f779c5">4.3.3. Converting strings</a></li>
<li><a href="#org2f8ec88">4.3.4. String concatenation</a></li>
<li><a href="#org5a4e93a">4.3.5. String Methods list</a></li>
<li><a href="#orgda9b70b">4.3.6. Obtaining substrings</a></li>
<li><a href="#org1f35c58">4.3.7. Converting between Strings and Numbers</a></li>
</ul>
</li>
<li><a href="#orgcd75637">4.4. Formatting output</a></li>
</ul>
</li>
<li><a href="#org5bba604">5. Chapter 5: Loops</a></li>
<li><a href="#org8c16b9e">6. Chapter 6: Methods (functions)</a></li>
<li><a href="#orgc2b1c49">7. Chapter 7: Arrays</a></li>
<li><a href="#org425d5d2">8. Chapter 8: Multidimensional Arrays</a></li>
<li><a href="#orge89df6b">9. Chapter 9: Objects and Classes</a>
<ul>
<li><a href="#org95150b6">9.1. Basic info</a></li>
<li><a href="#orgb6fda8a">9.2. Constructors</a></li>
<li><a href="#org56348f9">9.3. Reference data fields</a></li>
<li><a href="#org86713d0">9.4. Garbage collection</a></li>
<li><a href="#org84196bb">9.5. Instance variables and methods</a></li>
<li><a href="#orgcda2215">9.6. Static variables, constants, and methods</a></li>
<li><a href="#org5e5496c">9.7. Visiblity Modifiers and Accessor/Mutator Methods</a>
<ul>
<li><a href="#org9d12475">9.7.1. public keyword</a></li>
<li><a href="#org1209034">9.7.2. private keyword</a></li>
<li><a href="#org25825d0">9.7.3. Examples</a></li>
</ul>
</li>
<li><a href="#orgf076b11">9.8. Immutable objects and classes</a></li>
<li><a href="#org682adb3">9.9. this keyword</a></li>
</ul>
</li>
<li><a href="#org3e4238e">10. <span class="todo TODO">TODO</span> Chapter 10: objects (review the book)</a></li>
<li><a href="#org76c1868">11. <span class="todo TODO">TODO</span> Chapter 11: inheritance and polymorphism</a></li>
</ul>
</div>
</div>
<blockquote>
<p>
THIS IS NOT AN ALTERNATIVE TO THE BOOK
</p>
</blockquote>

<hr />
<div id="outline-container-org93b4093" class="outline-2">
<h2 id="org93b4093"><span class="section-number-2">1</span> Chapter 1: Introduction to Java</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org27a1538" class="outline-3">
<h3 id="org27a1538"><span class="section-number-3">1.1</span> Simple Java Program</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-java" id="orgcb6a03d"><span style="color: #FC5FA3; font-weight: bold;">class</span> <span style="color: #5DD8FF;">App</span> <span style="color: #A167E6;">{</span>
    <span style="color: #FC5FA3; font-weight: bold;">public</span> <span style="color: #FC5FA3; font-weight: bold;">static</span> <span style="color: #5DD8FF;">void</span> <span style="color: #41A1C0;">main</span><span style="color: #5DD8FF;">(</span><span style="color: #5DD8FF;">String</span><span style="color: #FD8F3F;">[]</span> <span style="color: #41A1C0;">args</span><span style="color: #5DD8FF;">)</span> <span style="color: #5DD8FF;">{</span>
        System.out.println<span style="color: #FD8F3F;">(</span><span style="color: #FC6A5D;">"Welcome to Java!"</span><span style="color: #FD8F3F;">)</span>;
    <span style="color: #5DD8FF;">}</span>
<span style="color: #A167E6;">}</span>
</pre>
</div>

<blockquote>
<p>
Java source files are compiled by Java compiler to bytecode (.class files) then
ran with Java Virtual Machine (JVM)
</p>
</blockquote>

<ul class="org-ul">
<li>Class name = App</li>
<li><p>
Main method = public static void main (arguments)
</p>

<p>
{ code in method }
</p></li>
<li>Statements = i.e. print statement
<ul class="org-ul">
<li>each statment in java must end with a semicolon (;)</li>
</ul></li>
<li>Reserved keywords
<ul class="org-ul">
<li>class</li>
<li>public</li>
<li>static</li>
<li>void</li>
<li>etc.</li>
</ul></li>
<li>Comments
<ul class="org-ul">
<li><p>
single line and multiline comments
</p>
<div class="org-src-container">
<pre class="src src-java">    <span style="color: #6C7986;">// </span><span style="color: #6C7986;">single line comment</span>
    <span style="color: #6C7986;">/* </span><span style="color: #6C7986;">multi line</span>
<span style="color: #6C7986;">     comment */</span>

</pre>
</div></li>
</ul></li>
<li>Blocks: a group of components of a program</li>
</ul>
<hr />
</div>
</div>
<div id="outline-container-org7b2276a" class="outline-3">
<h3 id="org7b2276a"><span class="section-number-3">1.2</span> Programming Style and documentation</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Appropriate Comments</li>
<li>Naming Conventions</li>
<li>Proper Identation and spacing lines</li>
<li>Block styles</li>
</ul>
</div>
</div>
<div id="outline-container-org602f428" class="outline-3">
<h3 id="org602f428"><span class="section-number-3">1.3</span> Programming Errors</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>Syntax Errors
<ul class="org-ul">
<li>Detected by the compiler (i.e. missing semicolon)</li>
</ul></li>
<li>Runtime Errors
<ul class="org-ul">
<li>Causes the program to abort (i.e. divition by zero)</li>
</ul></li>
<li>Logic Errors
<ul class="org-ul">
<li>Produces incorrect results (i.e. incorrect logic)</li>
</ul></li>
</ul>
<hr />
</div>
</div>
</div>
<div id="outline-container-orga37f009" class="outline-2">
<h2 id="orga37f009"><span class="section-number-2">2</span> Chapter 2: Elementry Programming</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgb8464af" class="outline-3">
<h3 id="orgb8464af"><span class="section-number-3">2.1</span> Program example:</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-java" id="orgcad769b"><span style="color: #FC5FA3; font-weight: bold;">public</span> <span style="color: #FC5FA3; font-weight: bold;">class</span> <span style="color: #5DD8FF;">App</span> <span style="color: #A167E6;">{</span>
    <span style="color: #FC5FA3; font-weight: bold;">public</span> <span style="color: #FC5FA3; font-weight: bold;">static</span> <span style="color: #5DD8FF;">void</span> <span style="color: #41A1C0;">main</span><span style="color: #5DD8FF;">(</span><span style="color: #5DD8FF;">String</span><span style="color: #FD8F3F;">[]</span> <span style="color: #41A1C0;">args</span><span style="color: #5DD8FF;">)</span> <span style="color: #5DD8FF;">{</span>
        <span style="color: #5DD8FF;">double</span> <span style="color: #41A1C0;">radius</span>;
        <span style="color: #5DD8FF;">double</span> <span style="color: #41A1C0;">area</span>;

        <span style="color: #6C7986;">// </span><span style="color: #6C7986;">assign a radius</span>
        radius = <span style="color: #D0BF68; font-weight: bold;">20</span>;

        <span style="color: #6C7986;">// </span><span style="color: #6C7986;">Compute Area</span>
        area = Math.pow<span style="color: #FD8F3F;">(</span>radius, <span style="color: #D0BF68; font-weight: bold;">2</span><span style="color: #FD8F3F;">)</span> * <span style="color: #A167E6;">Math</span>.PI;
        <span style="color: #6C7986;">// </span><span style="color: #67B7A4; font-weight: bold;">NOTE:</span><span style="color: #6C7986;"> Math pow function returns a double</span>

        <span style="color: #6C7986;">// </span><span style="color: #6C7986;">Display result</span>
        System.out.println<span style="color: #FD8F3F;">(</span><span style="color: #FC6A5D;">"The Area: "</span> + area + <span style="color: #FC6A5D;">" for radius: "</span> + radius<span style="color: #FD8F3F;">)</span>;
    <span style="color: #5DD8FF;">}</span>
<span style="color: #A167E6;">}</span>
</pre>
</div>
<hr />
</div>
</div>
