ics108.org
** Reading Input
Reading Input can be done by creating a Scanner Object
which can be imported from `java.util.Scanner;`
#+NAME: Input Scanner example
#+begin_src java

// import module.class
import java.util.Scanner;

class App {
    public static void main(String[] args ) {
        Scanner input = new Scanner(System.in);
        System.out.print("Enter a double value: ");
        double d = input.nextDouble();

        // to get int: use 'input.nextInt();'
        // float: use input.nextFloat();
        // for String: use input.next(); or input.nextLine();
        // for Char use String input then
        // get the first char (code below)
        // String.s = input.nextLine();
        // char ch = s.charAt(0);

        input.close();
        /*
          good practice is to
          close scanners and files
           ,*/
        // Display output
        System.out.println("the double value is " + d);
    }
}
#+end_src
-----
** Imports
+ Implicit import =import java.util.*;=
+ Explicit import =import java.util.Scanner;=
No Performance difference
-----

** Identifiers
+ sequence of chars are from letters, digits, underscores(_) and dollar signs($).
+ An identifier must start with a letter, an underscore or a dollar sign,
  #+begin_center
  IT CANNOT START WITH A DIGIT.
  #+end_center
+ An identifier cannot be a reserved word or default types such as (true, false etc.).
+ An identifier can be of any length.
-----
** Variables
*** declare variables
  #+begin_src java
  int x = 1; // variable example

  // other variables
  double y = 12.0;
  char b = 's';
  String u = "Bruh";

  #+end_src
  
  'int' is a type,

  'x' is an identifier,

  '1' is an int value,

  ';' is for statement termination,

  '=' is for assignment
-----
*** Constant variables

  #+begin_src java
  final int SIZE = 3;
  // final keyword is written before datatype
  // to indicate that the variable is immutable
  #+end_src

-----
** Naming Conventions
choose meaningful names
*** Variable and method names
use lowercase and capitalize each word after the first word

#+begin_src java
int computeArea(int area, int radius) {
    int computedResult = area * radius; // example
    return computedResult;
}
#+end_src
-----
*** Class names
Capitalize first letter of each word in the name
for example
#+begin_src java
class ComputeArea {  }
#+end_src
-----
*** Constant names
Capitalize all letters

for example
#+begin_src java
final int MAX_VALUE = 100;
#+end_src

-----
** Operators
    + (+) add
    + (-) substract
    + (*) multiply
    + (/) divide
    + (%) remainder i.e. 5 % 2 == 1
-----
*** useful operations
#+begin_src java
i = i + 1; 
i += 1;
i++;
++i;
 // these 4 statements are the same

++i; // adds then uses the value
i++; // uses the value then adds
--i;
i--;
// but if it is a statement by it self then
// it wouldn't matter much

// other operators's support
i += 1; i -= 1; i *= 1; i /= 1; i %= 1; 

#+end_src
-----
** Data types
*** Integers
are numbers without decimal values and range between
-2^31 to (2^31) - 1

example:
#+begin_src java
final int MAX_INT =  2147483647;
final int MIN_INT = -2147483648;

// example
int x = 100;
#+end_src
