ics108.html
<div id="outline-container-orgf821ef4" class="outline-3">
<h3 id="orgf821ef4"><span class="section-number-3">2.2</span> Reading Input</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Reading Input can be done by creating a Scanner Object
which can be imported from `java.util.Scanner;`
</p>
<div class="org-src-container">
<pre class="src src-java" id="orgc4418c0">
<span style="color: #6C7986;">// </span><span style="color: #6C7986;">import module.class</span>
<span style="color: #FC5FA3; font-weight: bold;">import</span> <span style="color: #A167E6;">java</span>.<span style="color: #A167E6;">util</span>.<span style="color: #5DD8FF;">Scanner</span>;

<span style="color: #FC5FA3; font-weight: bold;">class</span> <span style="color: #5DD8FF;">App</span> <span style="color: #A167E6;">{</span>
    <span style="color: #FC5FA3; font-weight: bold;">public</span> <span style="color: #FC5FA3; font-weight: bold;">static</span> <span style="color: #5DD8FF;">void</span> <span style="color: #41A1C0;">main</span><span style="color: #5DD8FF;">(</span><span style="color: #5DD8FF;">String</span><span style="color: #FD8F3F;">[]</span> <span style="color: #41A1C0;">args</span> <span style="color: #5DD8FF;">)</span> <span style="color: #5DD8FF;">{</span>
        <span style="color: #5DD8FF;">Scanner</span> <span style="color: #41A1C0;">input</span> = <span style="color: #FC5FA3; font-weight: bold;">new</span> <span style="color: #5DD8FF;">Scanner</span><span style="color: #FD8F3F;">(</span>System.in<span style="color: #FD8F3F;">)</span>;
        System.out.print<span style="color: #FD8F3F;">(</span><span style="color: #FC6A5D;">"Enter a double value: "</span><span style="color: #FD8F3F;">)</span>;
        <span style="color: #5DD8FF;">double</span> <span style="color: #41A1C0;">d</span> = input.nextDouble<span style="color: #FD8F3F;">()</span>;

        <span style="color: #6C7986;">// </span><span style="color: #6C7986;">to get int: use 'input.nextInt();'</span>
        <span style="color: #6C7986;">// </span><span style="color: #6C7986;">float: use input.nextFloat();</span>
        <span style="color: #6C7986;">// </span><span style="color: #6C7986;">for String: use input.next(); or input.nextLine();</span>
        <span style="color: #6C7986;">// </span><span style="color: #6C7986;">for Char use String input then</span>
        <span style="color: #6C7986;">// </span><span style="color: #6C7986;">get the first char (code below)</span>
        <span style="color: #6C7986;">// </span><span style="color: #6C7986;">String.s = input.nextLine();</span>
        <span style="color: #6C7986;">// </span><span style="color: #6C7986;">char ch = s.charAt(0);</span>

        input.close<span style="color: #FD8F3F;">()</span>;
        <span style="color: #6C7986;">/*</span>
<span style="color: #6C7986;">          good practice is to</span>
<span style="color: #6C7986;">          close scanners and files</span>
<span style="color: #6C7986;">           */</span>
        <span style="color: #6C7986;">// </span><span style="color: #6C7986;">Display output</span>
        System.out.println<span style="color: #FD8F3F;">(</span><span style="color: #FC6A5D;">"the double value is "</span> + d<span style="color: #FD8F3F;">)</span>;
    <span style="color: #5DD8FF;">}</span>
<span style="color: #A167E6;">}</span>
</pre>
</div>
<hr />
</div>
</div>
<div id="outline-container-org8e4f8a2" class="outline-3">
<h3 id="org8e4f8a2"><span class="section-number-3">2.3</span> Imports</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>Implicit import <code>import java.util.*;</code></li>
<li>Explicit import <code>import java.util.Scanner;</code></li>
</ul>
<p>
No Performance difference
</p>
<hr />
</div>
</div>

<div id="outline-container-org99ba442" class="outline-3">
<h3 id="org99ba442"><span class="section-number-3">2.4</span> Identifiers</h3>
<div class="outline-text-3" id="text-2-4">
<ul class="org-ul">
<li>sequence of chars are from letters, digits, underscores(_) and dollar signs($).</li>
<li><p>
An identifier must start with a letter, an underscore or a dollar sign,
</p>
<div class="org-center">
<p>
IT CANNOT START WITH A DIGIT.
</p>
</div></li>
<li>An identifier cannot be a reserved word or default types such as (true, false etc.).</li>
<li>An identifier can be of any length.</li>
</ul>
<hr />
</div>
</div>
<div id="outline-container-orgfedaa9a" class="outline-3">
<h3 id="orgfedaa9a"><span class="section-number-3">2.5</span> Variables</h3>
<div class="outline-text-3" id="text-2-5">
</div>
<div id="outline-container-org33b9663" class="outline-4">
<h4 id="org33b9663"><span class="section-number-4">2.5.1</span> declare variables</h4>
<div class="outline-text-4" id="text-2-5-1">
<div class="org-src-container">
<pre class="src src-java">  <span style="color: #5DD8FF;">int</span> <span style="color: #41A1C0;">x</span> = <span style="color: #D0BF68; font-weight: bold;">1</span>; <span style="color: #6C7986;">// </span><span style="color: #6C7986;">variable example</span>

  <span style="color: #6C7986;">// </span><span style="color: #6C7986;">other variables</span>
  <span style="color: #5DD8FF;">double</span> <span style="color: #41A1C0;">y</span> = <span style="color: #D0BF68; font-weight: bold;">12.0</span>;
  <span style="color: #5DD8FF;">char</span> <span style="color: #41A1C0;">b</span> = <span style="color: #FC6A5D;">'s'</span>;
  <span style="color: #5DD8FF;">String</span> <span style="color: #41A1C0;">u</span> = <span style="color: #FC6A5D;">"Bruh"</span>;

</pre>
</div>

<p>
&rsquo;int&rsquo; is a type,
</p>

<p>
&rsquo;x&rsquo; is an identifier,
</p>

<p>
&rsquo;1&rsquo; is an int value,
</p>

<p>
&rsquo;;&rsquo; is for statement termination,
</p>

<p>
&rsquo;=&rsquo; is for assignment
</p>
<hr />
</div>
</div>
<div id="outline-container-org2a482cc" class="outline-4">
<h4 id="org2a482cc"><span class="section-number-4">2.5.2</span> Constant variables</h4>
<div class="outline-text-4" id="text-2-5-2">
<div class="org-src-container">
<pre class="src src-java">  <span style="color: #FC5FA3; font-weight: bold;">final</span> <span style="color: #5DD8FF;">int</span> <span style="color: #41A1C0;">SIZE</span> = <span style="color: #D0BF68; font-weight: bold;">3</span>;
  <span style="color: #6C7986;">// </span><span style="color: #6C7986;">final keyword is written before datatype</span>
  <span style="color: #6C7986;">// </span><span style="color: #6C7986;">to indicate that the variable is immutable</span>
</pre>
</div>

<hr />
</div>
</div>
</div>
<div id="outline-container-org0dd798f" class="outline-3">
<h3 id="org0dd798f"><span class="section-number-3">2.6</span> Naming Conventions</h3>
<div class="outline-text-3" id="text-2-6">
<p>
choose meaningful names
</p>
</div>
<div id="outline-container-org6499de6" class="outline-4">
<h4 id="org6499de6"><span class="section-number-4">2.6.1</span> Variable and method names</h4>
<div class="outline-text-4" id="text-2-6-1">
<p>
use lowercase and capitalize each word after the first word
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #5DD8FF;">int</span> <span style="color: #41A1C0;">computeArea</span><span style="color: #A167E6;">(</span><span style="color: #5DD8FF;">int</span> <span style="color: #41A1C0;">area</span>, <span style="color: #5DD8FF;">int</span> <span style="color: #41A1C0;">radius</span><span style="color: #A167E6;">)</span> <span style="color: #A167E6;">{</span>
    <span style="color: #5DD8FF;">int</span> <span style="color: #41A1C0;">computedResult</span> = area * radius; <span style="color: #6C7986;">// </span><span style="color: #6C7986;">example</span>
    <span style="color: #FC5FA3; font-weight: bold;">return</span> computedResult;
<span style="color: #A167E6;">}</span>
</pre>
</div>
<hr />
</div>
</div>
<div id="outline-container-orgea89ff0" class="outline-4">
<h4 id="orgea89ff0"><span class="section-number-4">2.6.2</span> Class names</h4>
<div class="outline-text-4" id="text-2-6-2">
<p>
Capitalize first letter of each word in the name
for example
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #FC5FA3; font-weight: bold;">class</span> <span style="color: #5DD8FF;">ComputeArea</span> <span style="color: #A167E6;">{</span>  <span style="color: #A167E6;">}</span>
</pre>
</div>
<hr />
</div>
</div>
<div id="outline-container-org22a3c47" class="outline-4">
<h4 id="org22a3c47"><span class="section-number-4">2.6.3</span> Constant names</h4>
<div class="outline-text-4" id="text-2-6-3">
<p>
Capitalize all letters
</p>

<p>
for example
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #FC5FA3; font-weight: bold;">final</span> <span style="color: #5DD8FF;">int</span> <span style="color: #41A1C0;">MAX_VALUE</span> = <span style="color: #D0BF68; font-weight: bold;">100</span>;
</pre>
</div>

<hr />
</div>
</div>
</div>
<div id="outline-container-org18234e2" class="outline-3">
<h3 id="org18234e2"><span class="section-number-3">2.7</span> Operators</h3>
<div class="outline-text-3" id="text-2-7">
<ul class="org-ul">
<li>(+) add</li>
<li>(-) substract</li>
<li>(*) multiply</li>
<li>(/) divide</li>
<li>(%) remainder i.e. 5 % 2 == 1</li>
</ul>
<hr />
</div>
<div id="outline-container-orgbfdb0c1" class="outline-4">
<h4 id="orgbfdb0c1"><span class="section-number-4">2.7.1</span> useful operations</h4>
<div class="outline-text-4" id="text-2-7-1">
<div class="org-src-container">
<pre class="src src-java">i = i + <span style="color: #D0BF68; font-weight: bold;">1</span>; 
i += <span style="color: #D0BF68; font-weight: bold;">1</span>;
i++;
++i;
 <span style="color: #6C7986;">// </span><span style="color: #6C7986;">these 4 statements are the same</span>

++i; <span style="color: #6C7986;">// </span><span style="color: #6C7986;">adds then uses the value</span>
i++; <span style="color: #6C7986;">// </span><span style="color: #6C7986;">uses the value then adds</span>
--i;
i--;
<span style="color: #6C7986;">// </span><span style="color: #6C7986;">but if it is a statement by it self then</span>
<span style="color: #6C7986;">// </span><span style="color: #6C7986;">it wouldn't matter much</span>

<span style="color: #6C7986;">// </span><span style="color: #6C7986;">other operators's support</span>
i += <span style="color: #D0BF68; font-weight: bold;">1</span>; i -= <span style="color: #D0BF68; font-weight: bold;">1</span>; i *= <span style="color: #D0BF68; font-weight: bold;">1</span>; i /= <span style="color: #D0BF68; font-weight: bold;">1</span>; i %= <span style="color: #D0BF68; font-weight: bold;">1</span>; 

</pre>
</div>
<hr />
</div>
</div>
</div>
<div id="outline-container-org3aa9e22" class="outline-3">
<h3 id="org3aa9e22"><span class="section-number-3">2.8</span> Data types</h3>
<div class="outline-text-3" id="text-2-8">
</div>
<div id="outline-container-orgdac1ed8" class="outline-4">
<h4 id="orgdac1ed8"><span class="section-number-4">2.8.1</span> Integers</h4>
<div class="outline-text-4" id="text-2-8-1">
<p>
are numbers without decimal values and range between
-2<sup>31</sup> to (2<sup>31</sup>) - 1
</p>

<p>
example:
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #FC5FA3; font-weight: bold;">final</span> <span style="color: #5DD8FF;">int</span> <span style="color: #41A1C0;">MAX_INT</span> =  <span style="color: #D0BF68; font-weight: bold;">2147483647</span>;
<span style="color: #FC5FA3; font-weight: bold;">final</span> <span style="color: #5DD8FF;">int</span> <span style="color: #41A1C0;">MIN_INT</span> = -<span style="color: #D0BF68; font-weight: bold;">2147483648</span>;

<span style="color: #6C7986;">// </span><span style="color: #6C7986;">example</span>
<span style="color: #5DD8FF;">int</span> <span style="color: #41A1C0;">x</span> = <span style="color: #D0BF68; font-weight: bold;">100</span>;
</pre>
</div>
</div>
</div>
