ics108.org
*** Floats and Double
are numbers with decimal points
by default Java will make any decimal point double unless added an F after it i.e.
letter D can be used for classifing as double.

#+begin_src java
float x = 10.0f; // f is written to indicate that the variable is float
double y = 10.0;
// also correct
double y2 = 10.0d;
#+end_src

#+begin_quote
NOTE: floating points are not accurate always during calculations and it is recommeneded to use double for more accuracy
#+end_quote

-----
*** Scientific Notation
Floating point literals can be specified in scientific notations using (e, E).

#+begin_quote
: NOTE: use double for more accuracy
#+end_quote

for example
#+begin_src java
double sciX = 10.2e20;
#+end_src

-----
*** Chars and Strings
are used to store text, char are for one character and strings are used for multiple characters

#+begin_src java
char b = 'a';
String str = "bruh why String is capital";
// NOTE: String data type first letter is capital
#+end_src

#+RESULTS:

-----
*** other types

+ byte: similar to int but smaller range (-128 to 127)
+ long: similar to int but bigger range
  (-2^63 to (2^63) - 1)

-----
*** Display Current Time in GMT
#+begin_src java
long time = System.currentTimeMillis();
// == current GMT time in milliseconds
#+end_src

-----
*** Conversion rules
1. if one of the operands is double then final value is Double
1. otherwise if one is float then the final value is float.
1. otherwise, if one of the operands is long then both are long.
1. finally they are int if one of them is int

-----
*** Type casting
+ implicit casting i.e.
  #+begin_src java
  double d = 3; // (type widening)
  #+end_src
+ Explicit casting i.e.
  #+begin_src java
  int i = (int) 3.0; // (type narrowing)
  int j = (int) 3.9; // (fraction part is truncated)
  // i = 3; j = 3;
  #+end_src

another example
#+begin_src java
int sum = 0;
sum += 4.5; // now sum is 4
#+end_src

-----
** Common Errors and pitfalls
**** Common Errors
1. Undeclared Variables and unused variables
   i.e. using Variables that do not exist.

1. Interger overflow
   using numbers over the max/min range

1. Round-off Errors
   when dealing with alot of float numbers

1. Unintended Integer division
    i.e. division over zero

1. Redundant Input objects
    i.e. getting wrong input
    for example: getting a string instead of an int.
-----
* Chapter 3: Selections
** More Data types
*** boolean type
bool values are true or false
#+begin_src java
boolean type = true;
type = false; // changed to false
#+end_src

*** boolean (comparasion operators)
=>=, =<=, =<==, =>==, etc.
i.e.
#+begin_src java
boolean x = 3 > 2; // true
boolean y = 4 < 3; // false

#+end_src
-----
** If else statements
*** if
checks for true boolean then excutes code in the block
*** else
if the 'if' condition is false then else block executes

#+begin_src java

int x = 1;

if (x > 0) {
    // if x is positive then this code block executes
    // NOTE: in this example the code here executes.
} else {
    // if x is negative the code here executes.
}


// also this is possible

if (x > 0) {
    // if x is positive
} else if (x < 0) {
    // if x is negative
} else {
    // if x is not positive nor negative
}

// the code will check at each statement
// also adding a semicolon at if or else is an error
// and it is a logic error
#+end_src

-----
