ics108.html
<div id="outline-container-org5dfcda2" class="outline-4">
<h4 id="org5dfcda2"><span class="section-number-4">2.8.2</span> Floats and Double</h4>
<div class="outline-text-4" id="text-2-8-2">
<p>
are numbers with decimal points
by default Java will make any decimal point double unless added an F after it i.e.
letter D can be used for classifing as double.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #5DD8FF;">float</span> <span style="color: #41A1C0;">x</span> = <span style="color: #D0BF68; font-weight: bold;">10</span>.0f; <span style="color: #6C7986;">// </span><span style="color: #6C7986;">f is written to indicate that the variable is float</span>
<span style="color: #5DD8FF;">double</span> <span style="color: #41A1C0;">y</span> = <span style="color: #D0BF68; font-weight: bold;">10.0</span>;
<span style="color: #6C7986;">// </span><span style="color: #6C7986;">also correct</span>
<span style="color: #5DD8FF;">double</span> <span style="color: #41A1C0;">y2</span> = <span style="color: #D0BF68; font-weight: bold;">10</span>.0d;
</pre>
</div>

<blockquote>
<p>
NOTE: floating points are not accurate always during calculations and it is recommeneded to use double for more accuracy
</p>
</blockquote>

<hr />
</div>
</div>
<div id="outline-container-org974df09" class="outline-4">
<h4 id="org974df09"><span class="section-number-4">2.8.3</span> Scientific Notation</h4>
<div class="outline-text-4" id="text-2-8-3">
<p>
Floating point literals can be specified in scientific notations using (e, E).
</p>

<blockquote>
<pre class="example">
NOTE: use double for more accuracy
</pre>
</blockquote>

<p>
for example
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #5DD8FF;">double</span> <span style="color: #41A1C0;">sciX</span> = <span style="color: #D0BF68; font-weight: bold;">10</span>.2e20;
</pre>
</div>

<hr />
</div>
</div>
<div id="outline-container-orgb98bf4b" class="outline-4">
<h4 id="orgb98bf4b"><span class="section-number-4">2.8.4</span> Chars and Strings</h4>
<div class="outline-text-4" id="text-2-8-4">
<p>
are used to store text, char are for one character and strings are used for multiple characters
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #5DD8FF;">char</span> <span style="color: #41A1C0;">b</span> = <span style="color: #FC6A5D;">'a'</span>;
<span style="color: #5DD8FF;">String</span> <span style="color: #41A1C0;">str</span> = <span style="color: #FC6A5D;">"bruh why String is capital"</span>;
<span style="color: #6C7986;">// </span><span style="color: #67B7A4; font-weight: bold;">NOTE:</span><span style="color: #6C7986;"> String data type first letter is capital</span>
</pre>
</div>

<hr />
</div>
</div>
<div id="outline-container-orgb1e9287" class="outline-4">
<h4 id="orgb1e9287"><span class="section-number-4">2.8.5</span> other types</h4>
<div class="outline-text-4" id="text-2-8-5">
<ul class="org-ul">
<li>byte: similar to int but smaller range (-128 to 127)</li>
<li>long: similar to int but bigger range
(-2<sup>63</sup> to (2<sup>63</sup>) - 1)</li>
</ul>

<hr />
</div>
</div>
<div id="outline-container-orgadc3627" class="outline-4">
<h4 id="orgadc3627"><span class="section-number-4">2.8.6</span> Display Current Time in GMT</h4>
<div class="outline-text-4" id="text-2-8-6">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #5DD8FF;">long</span> <span style="color: #41A1C0;">time</span> = System.currentTimeMillis<span style="color: #A167E6;">()</span>;
<span style="color: #6C7986;">// </span><span style="color: #6C7986;">== current GMT time in milliseconds</span>
</pre>
</div>

<hr />
</div>
</div>
<div id="outline-container-org256ab79" class="outline-4">
<h4 id="org256ab79"><span class="section-number-4">2.8.7</span> Conversion rules</h4>
<div class="outline-text-4" id="text-2-8-7">
<ol class="org-ol">
<li>if one of the operands is double then final value is Double</li>
<li>otherwise if one is float then the final value is float.</li>
<li>otherwise, if one of the operands is long then both are long.</li>
<li>finally they are int if one of them is int</li>
</ol>

<hr />
</div>
</div>
<div id="outline-container-org5c32fe1" class="outline-4">
<h4 id="org5c32fe1"><span class="section-number-4">2.8.8</span> Type casting</h4>
<div class="outline-text-4" id="text-2-8-8">
<ul class="org-ul">
<li><p>
implicit casting i.e.
</p>
<div class="org-src-container">
<pre class="src src-java">  <span style="color: #5DD8FF;">double</span> <span style="color: #41A1C0;">d</span> = <span style="color: #D0BF68; font-weight: bold;">3</span>; <span style="color: #6C7986;">// </span><span style="color: #6C7986;">(type widening)</span>
</pre>
</div></li>
<li><p>
Explicit casting i.e.
</p>
<div class="org-src-container">
<pre class="src src-java">  <span style="color: #5DD8FF;">int</span> <span style="color: #41A1C0;">i</span> = <span style="color: #A167E6;">(</span><span style="color: #5DD8FF;">int</span><span style="color: #A167E6;">)</span> <span style="color: #D0BF68; font-weight: bold;">3.0</span>; <span style="color: #6C7986;">// </span><span style="color: #6C7986;">(type narrowing)</span>
  <span style="color: #5DD8FF;">int</span> <span style="color: #41A1C0;">j</span> = <span style="color: #A167E6;">(</span><span style="color: #5DD8FF;">int</span><span style="color: #A167E6;">)</span> <span style="color: #D0BF68; font-weight: bold;">3.9</span>; <span style="color: #6C7986;">// </span><span style="color: #6C7986;">(fraction part is truncated)</span>
  <span style="color: #6C7986;">// </span><span style="color: #6C7986;">i = 3; j = 3;</span>
</pre>
</div></li>
</ul>

<p>
another example
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #5DD8FF;">int</span> <span style="color: #41A1C0;">sum</span> = <span style="color: #D0BF68; font-weight: bold;">0</span>;
sum += <span style="color: #D0BF68; font-weight: bold;">4.5</span>; <span style="color: #6C7986;">// </span><span style="color: #6C7986;">now sum is 4</span>
</pre>
</div>

<hr />
</div>
</div>
</div>
<div id="outline-container-org9c1592b" class="outline-3">
<h3 id="org9c1592b"><span class="section-number-3">2.9</span> Common Errors and pitfalls</h3>
<div class="outline-text-3" id="text-2-9">
</div>
<ol class="org-ol">
<li><a id="org06d4bf8"></a>Common Errors<br />
<div class="outline-text-5" id="text-2-9-0-1">
<ol class="org-ol">
<li>Undeclared Variables and unused variables
i.e. using Variables that do not exist.</li>

<li>Interger overflow
using numbers over the max/min range</li>

<li>Round-off Errors
when dealing with alot of float numbers</li>

<li>Unintended Integer division
i.e. division over zero</li>

<li>Redundant Input objects
i.e. getting wrong input
for example: getting a string instead of an int.</li>
</ol>
<hr />
</div>
</li>
</ol>
</div>
</div>
<div id="outline-container-org98cd49b" class="outline-2">
<h2 id="org98cd49b"><span class="section-number-2">3</span> Chapter 3: Selections</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgdf5f9f3" class="outline-3">
<h3 id="orgdf5f9f3"><span class="section-number-3">3.1</span> More Data types</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-org59c5dd1" class="outline-4">
<h4 id="org59c5dd1"><span class="section-number-4">3.1.1</span> boolean type</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
bool values are true or false
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #5DD8FF;">boolean</span> <span style="color: #41A1C0;">type</span> = <span style="color: #A167E6;">true</span>;
type = <span style="color: #A167E6;">false</span>; <span style="color: #6C7986;">// </span><span style="color: #6C7986;">changed to false</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org961f4a8" class="outline-4">
<h4 id="org961f4a8"><span class="section-number-4">3.1.2</span> boolean (comparasion operators)</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
<code>&gt;</code>, <code>&lt;</code>, <code>&lt;=</code>, <code>&gt;=</code>, etc.
i.e.
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #5DD8FF;">boolean</span> <span style="color: #41A1C0;">x</span> = <span style="color: #D0BF68; font-weight: bold;">3</span> &gt; <span style="color: #D0BF68; font-weight: bold;">2</span>; <span style="color: #6C7986;">// </span><span style="color: #6C7986;">true</span>
<span style="color: #5DD8FF;">boolean</span> <span style="color: #41A1C0;">y</span> = <span style="color: #D0BF68; font-weight: bold;">4</span> &lt; <span style="color: #D0BF68; font-weight: bold;">3</span>; <span style="color: #6C7986;">// </span><span style="color: #6C7986;">false</span>

</pre>
</div>
<hr />
</div>
</div>
</div>
<div id="outline-container-orgd8b2aee" class="outline-3">
<h3 id="orgd8b2aee"><span class="section-number-3">3.2</span> If else statements</h3>
<div class="outline-text-3" id="text-3-2">
</div>
<div id="outline-container-org7e07fa7" class="outline-4">
<h4 id="org7e07fa7"><span class="section-number-4">3.2.1</span> if</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
checks for true boolean then excutes code in the block
</p>
</div>
</div>
<div id="outline-container-org956ce76" class="outline-4">
<h4 id="org956ce76"><span class="section-number-4">3.2.2</span> else</h4>
<div class="outline-text-4" id="text-3-2-2">
<p>
if the &rsquo;if&rsquo; condition is false then else block executes
</p>

<div class="org-src-container">
<pre class="src src-java">
<span style="color: #5DD8FF;">int</span> <span style="color: #41A1C0;">x</span> = <span style="color: #D0BF68; font-weight: bold;">1</span>;

<span style="color: #FC5FA3; font-weight: bold;">if</span> <span style="color: #A167E6;">(</span>x &gt; <span style="color: #D0BF68; font-weight: bold;">0</span><span style="color: #A167E6;">)</span> <span style="color: #A167E6;">{</span>
    <span style="color: #6C7986;">// </span><span style="color: #6C7986;">if x is positive then this code block executes</span>
    <span style="color: #6C7986;">// </span><span style="color: #67B7A4; font-weight: bold;">NOTE:</span><span style="color: #6C7986;"> in this example the code here executes.</span>
<span style="color: #A167E6;">}</span> <span style="color: #FC5FA3; font-weight: bold;">else</span> <span style="color: #A167E6;">{</span>
    <span style="color: #6C7986;">// </span><span style="color: #6C7986;">if x is negative the code here executes.</span>
<span style="color: #A167E6;">}</span>


<span style="color: #6C7986;">// </span><span style="color: #6C7986;">also this is possible</span>

<span style="color: #FC5FA3; font-weight: bold;">if</span> <span style="color: #A167E6;">(</span>x &gt; <span style="color: #D0BF68; font-weight: bold;">0</span><span style="color: #A167E6;">)</span> <span style="color: #A167E6;">{</span>
    <span style="color: #6C7986;">// </span><span style="color: #6C7986;">if x is positive</span>
<span style="color: #A167E6;">}</span> <span style="color: #FC5FA3; font-weight: bold;">else</span> <span style="color: #FC5FA3; font-weight: bold;">if</span> <span style="color: #A167E6;">(</span>x &lt; <span style="color: #D0BF68; font-weight: bold;">0</span><span style="color: #A167E6;">)</span> <span style="color: #A167E6;">{</span>
    <span style="color: #6C7986;">// </span><span style="color: #6C7986;">if x is negative</span>
<span style="color: #A167E6;">}</span> <span style="color: #FC5FA3; font-weight: bold;">else</span> <span style="color: #A167E6;">{</span>
    <span style="color: #6C7986;">// </span><span style="color: #6C7986;">if x is not positive nor negative</span>
<span style="color: #A167E6;">}</span>

<span style="color: #6C7986;">// </span><span style="color: #6C7986;">the code will check at each statement</span>
<span style="color: #6C7986;">// </span><span style="color: #6C7986;">also adding a semicolon at if or else is an error</span>
<span style="color: #6C7986;">// </span><span style="color: #6C7986;">and it is a logic error</span>
</pre>
</div>

<hr />
</div>
</div>
</div>
