ics108.org
** Logical operators

| operator     | name         | description         |
|--------------+--------------+---------------------|
| =!=          | not          | logical negation    |
| =&&=         | and          | logical conjunction |
| =^=          | exclusive or | logical exclusive   |
| =\vert\vert= | or           | logical disjunction |
|--------------+--------------+---------------------|

 examples:
#+begin_src java
int x = 1;
if (x != 1) {
    // wont execute
}

int y = 0;
if (x == 1 && y == 0) {
    // will execute
}


// '^' operator
// if both are true or false then it will evaluate as
// false otherwise if one is false and the other isnt
// it will evaluate as true

//   false    true
if (x != 1 ^ y == 0) {
    // will execute
}

bool a = false;

if (!a)
    // will be true and execute

bool b = true;

if ( a || b ) {
    // will execute (true)
}

#+end_src

-----
Leap year example

#+begin_src java
int year = 2021; // use input or get the year number

if ((year % 4 == 0 && year % 100 != 0) || (year % 400 == 0)) {
    System.out.println("Year is leap");
}
#+end_src
-----
** Switch statement
alternative to if statements equating with specific value.

#+begin_src java

int x = 1;

switch (x) {
    case 1:
        // code if x == 1
        break;
    case 2:
        // code if x == 2
        break;
    default:
        // insert if value doesnt match the cases
        break;
}

#+end_src
-----
** Conditional operators: Ternary
(boolean) ? (if boolean is true) : (if boolean is false);
#+begin_src java
boolean x = true;

int b = x ? 1 : 0; // now b is 1 cuz x is true

int c = !x ? 1 : 0; // c is 0

#+end_src
-----

** Operator order (precedence)
1. =var++=, =var--=
2. =+=, =-=, and =++var=, =--var=.
3. =(type)= cast
4. =!= (Not)
5. =*=, =/=, =%=
6. =+=, =-=
7. =<=, =<==, =>=, =>==
8. ==== , =!==
9. =^= (Exclusive or)
10. =&&=
11. =||=
12. ====, =+==, =-==, =*==, =/==, =%==
-----

** Debugging

#+begin_center
=NOTE: use a debugger when facing problems=
#+end_center

-----

* Chapter 4: Math functions, Chars and Strings
** Math Class
*** Constants
+ =PI=

+ =E=
-----

*** Methods
**** Trigonometric Methods
return double always
+ =sin(double a);=

+ =cos(double a);=

+ =tan(double a);=

+ =acos(double a);=

+ =asin(double a);=

+ =atan(double a);=

+ =toRadians(double a);= // converts to radians

+ =toDegrees(double a);=

-----
**** Rounding Methods
+ =ceil(double x)=
  x is rounded up to nearest int then returned as double

+ =floor(double x)=
  x is rounded down to nearest int then returned as double

+ =rint(double x)=
  x is returned to the nearest int, if x is equally close to both then the even one is returned as double

+ =round(float x)=
  returns (int)Math.floor(x + 0.5);

+ =round(double x)=
  returns (long)Math.floor(x + 0.5);
#+begin_center
NOTE: check examples in slides for Chapter4 page:(8)
#+end_center
-----
**** Exponent Methods
***** TODO Methods

-----
**** min, max, abs, and Random Methods
+ =max(a, b)= and =min(a, b)=
  return max or min of the 2 arguments
+ =abs(a)= returns the absolute value
+ =random()= returns a random double (from 0.0 to 1.0)
-----
** Characters
