ics108.html
<div id="outline-container-org643c1a2" class="outline-3">
<h3 id="org643c1a2"><span class="section-number-3">3.3</span> Logical operators</h3>
<div class="outline-text-3" id="text-3-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">operator</th>
<th scope="col" class="org-left">name</th>
<th scope="col" class="org-left">description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>!</code></td>
<td class="org-left">not</td>
<td class="org-left">logical negation</td>
</tr>

<tr>
<td class="org-left"><code>&amp;&amp;</code></td>
<td class="org-left">and</td>
<td class="org-left">logical conjunction</td>
</tr>

<tr>
<td class="org-left"><code>^</code></td>
<td class="org-left">exclusive or</td>
<td class="org-left">logical exclusive</td>
</tr>

<tr>
<td class="org-left"><code>\vert\vert</code></td>
<td class="org-left">or</td>
<td class="org-left">logical disjunction</td>
</tr>
</tbody>
</table>

<p>
examples:
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #5DD8FF;">int</span> <span style="color: #41A1C0;">x</span> = <span style="color: #D0BF68; font-weight: bold;">1</span>;
<span style="color: #FC5FA3; font-weight: bold;">if</span> <span style="color: #A167E6;">(</span>x != <span style="color: #D0BF68; font-weight: bold;">1</span><span style="color: #A167E6;">)</span> <span style="color: #A167E6;">{</span>
    <span style="color: #6C7986;">// </span><span style="color: #6C7986;">wont execute</span>
<span style="color: #A167E6;">}</span>

<span style="color: #5DD8FF;">int</span> <span style="color: #41A1C0;">y</span> = <span style="color: #D0BF68; font-weight: bold;">0</span>;
<span style="color: #FC5FA3; font-weight: bold;">if</span> <span style="color: #A167E6;">(</span>x == <span style="color: #D0BF68; font-weight: bold;">1</span> &amp;&amp; y == <span style="color: #D0BF68; font-weight: bold;">0</span><span style="color: #A167E6;">)</span> <span style="color: #A167E6;">{</span>
    <span style="color: #6C7986;">// </span><span style="color: #6C7986;">will execute</span>
<span style="color: #A167E6;">}</span>


<span style="color: #6C7986;">// </span><span style="color: #6C7986;">'^' operator</span>
<span style="color: #6C7986;">// </span><span style="color: #6C7986;">if both are true or false then it will evaluate as</span>
<span style="color: #6C7986;">// </span><span style="color: #6C7986;">false otherwise if one is false and the other isnt</span>
<span style="color: #6C7986;">// </span><span style="color: #6C7986;">it will evaluate as true</span>

<span style="color: #6C7986;">//   </span><span style="color: #6C7986;">false    true</span>
<span style="color: #FC5FA3; font-weight: bold;">if</span> <span style="color: #A167E6;">(</span>x != <span style="color: #D0BF68; font-weight: bold;">1</span> ^ y == <span style="color: #D0BF68; font-weight: bold;">0</span><span style="color: #A167E6;">)</span> <span style="color: #A167E6;">{</span>
    <span style="color: #6C7986;">// </span><span style="color: #6C7986;">will execute</span>
<span style="color: #A167E6;">}</span>

<span style="color: #5DD8FF;">bool</span> <span style="color: #41A1C0;">a</span> = <span style="color: #A167E6;">false</span>;

<span style="color: #FC5FA3; font-weight: bold;">if</span> <span style="color: #A167E6;">(</span><span style="color: #FD8F3F; font-weight: bold;">!</span>a<span style="color: #A167E6;">)</span>
    <span style="color: #6C7986;">// </span><span style="color: #6C7986;">will be true and execute</span>

bool b = <span style="color: #A167E6;">true</span>;

<span style="color: #FC5FA3; font-weight: bold;">if</span> <span style="color: #A167E6;">(</span> a || b <span style="color: #A167E6;">)</span> <span style="color: #A167E6;">{</span>
    <span style="color: #6C7986;">// </span><span style="color: #6C7986;">will execute (true)</span>
<span style="color: #A167E6;">}</span>

</pre>
</div>

<hr />
<p>
Leap year example
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #5DD8FF;">int</span> <span style="color: #41A1C0;">year</span> = <span style="color: #D0BF68; font-weight: bold;">2021</span>; <span style="color: #6C7986;">// </span><span style="color: #6C7986;">use input or get the year number</span>

<span style="color: #FC5FA3; font-weight: bold;">if</span> <span style="color: #A167E6;">(</span><span style="color: #5DD8FF;">(</span>year % <span style="color: #D0BF68; font-weight: bold;">4</span> == <span style="color: #D0BF68; font-weight: bold;">0</span> &amp;&amp; year % <span style="color: #D0BF68; font-weight: bold;">100</span> != <span style="color: #D0BF68; font-weight: bold;">0</span><span style="color: #5DD8FF;">)</span> || <span style="color: #5DD8FF;">(</span>year % <span style="color: #D0BF68; font-weight: bold;">400</span> == <span style="color: #D0BF68; font-weight: bold;">0</span><span style="color: #5DD8FF;">)</span><span style="color: #A167E6;">)</span> <span style="color: #A167E6;">{</span>
    System.out.println<span style="color: #5DD8FF;">(</span><span style="color: #FC6A5D;">"Year is leap"</span><span style="color: #5DD8FF;">)</span>;
<span style="color: #A167E6;">}</span>
</pre>
</div>
<hr />
</div>
</div>
<div id="outline-container-org6bd2f91" class="outline-3">
<h3 id="org6bd2f91"><span class="section-number-3">3.4</span> Switch statement</h3>
<div class="outline-text-3" id="text-3-4">
<p>
alternative to if statements equating with specific value.
</p>

<div class="org-src-container">
<pre class="src src-java">
<span style="color: #5DD8FF;">int</span> <span style="color: #41A1C0;">x</span> = <span style="color: #D0BF68; font-weight: bold;">1</span>;

<span style="color: #FC5FA3; font-weight: bold;">switch</span> <span style="color: #A167E6;">(</span>x<span style="color: #A167E6;">)</span> <span style="color: #A167E6;">{</span>
    <span style="color: #FC5FA3; font-weight: bold;">case</span> <span style="color: #D0BF68; font-weight: bold;">1</span>:
        <span style="color: #6C7986;">// </span><span style="color: #6C7986;">code if x == 1</span>
        <span style="color: #FC5FA3; font-weight: bold;">break</span>;
    <span style="color: #FC5FA3; font-weight: bold;">case</span> <span style="color: #D0BF68; font-weight: bold;">2</span>:
        <span style="color: #6C7986;">// </span><span style="color: #6C7986;">code if x == 2</span>
        <span style="color: #FC5FA3; font-weight: bold;">break</span>;
    <span style="color: #FC5FA3; font-weight: bold;">default</span>:
        <span style="color: #6C7986;">// </span><span style="color: #6C7986;">insert if value doesnt match the cases</span>
        <span style="color: #FC5FA3; font-weight: bold;">break</span>;
<span style="color: #A167E6;">}</span>

</pre>
</div>
<hr />
</div>
</div>
<div id="outline-container-org3c4048a" class="outline-3">
<h3 id="org3c4048a"><span class="section-number-3">3.5</span> Conditional operators: Ternary</h3>
<div class="outline-text-3" id="text-3-5">
<p>
(boolean) ? (if boolean is true) : (if boolean is false);
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #5DD8FF;">boolean</span> <span style="color: #41A1C0;">x</span> = <span style="color: #A167E6;">true</span>;

<span style="color: #5DD8FF;">int</span> <span style="color: #41A1C0;">b</span> = x ? <span style="color: #D0BF68; font-weight: bold;">1</span> : <span style="color: #D0BF68; font-weight: bold;">0</span>; <span style="color: #6C7986;">// </span><span style="color: #6C7986;">now b is 1 cuz x is true</span>

<span style="color: #5DD8FF;">int</span> <span style="color: #41A1C0;">c</span> = <span style="color: #FD8F3F; font-weight: bold;">!</span>x ? <span style="color: #D0BF68; font-weight: bold;">1</span> : <span style="color: #D0BF68; font-weight: bold;">0</span>; <span style="color: #6C7986;">// </span><span style="color: #6C7986;">c is 0</span>

</pre>
</div>
<hr />
</div>
</div>

<div id="outline-container-org6a35820" class="outline-3">
<h3 id="org6a35820"><span class="section-number-3">3.6</span> Operator order (precedence)</h3>
<div class="outline-text-3" id="text-3-6">
<ol class="org-ol">
<li><code>var++</code>, <code>var--</code></li>
<li><code>+</code>, <code>-</code>, and <code>++var</code>, <code>--var</code>.</li>
<li><code>(type)</code> cast</li>
<li><code>!</code> (Not)</li>
<li><code>*</code>, <code>/</code>, <code>%</code></li>
<li><code>+</code>, <code>-</code></li>
<li><code>&lt;</code>, <code>&lt;=</code>, <code>&gt;</code>, <code>&gt;=</code></li>
<li><code>==</code> , <code>!=</code></li>
<li><code>^</code> (Exclusive or)</li>
<li><code>&amp;&amp;</code></li>
<li><code>||</code></li>
<li><code>==</code>, <code>+=</code>, <code>-=</code>, <code>*=</code>, <code>/=</code>, <code>%=</code></li>
</ol>
<hr />
</div>
</div>

<div id="outline-container-org50d24f5" class="outline-3">
<h3 id="org50d24f5"><span class="section-number-3">3.7</span> Debugging</h3>
<div class="outline-text-3" id="text-3-7">
<div class="org-center">
<p>
<code>NOTE: use a debugger when facing problems</code>
</p>
</div>

<hr />
</div>
</div>
</div>

<div id="outline-container-orga4d24c0" class="outline-2">
<h2 id="orga4d24c0"><span class="section-number-2">4</span> Chapter 4: Math functions, Chars and Strings</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org875d8ae" class="outline-3">
<h3 id="org875d8ae"><span class="section-number-3">4.1</span> Math Class</h3>
<div class="outline-text-3" id="text-4-1">
</div>
<div id="outline-container-orga8f57ec" class="outline-4">
<h4 id="orga8f57ec"><span class="section-number-4">4.1.1</span> Constants</h4>
<div class="outline-text-4" id="text-4-1-1">
<ul class="org-ul">
<li><code>PI</code></li>

<li><code>E</code></li>
</ul>
<hr />
</div>
</div>

<div id="outline-container-orge6679b1" class="outline-4">
<h4 id="orge6679b1"><span class="section-number-4">4.1.2</span> Methods</h4>
<div class="outline-text-4" id="text-4-1-2">
</div>
<ol class="org-ol">
<li><a id="org400d4b7"></a>Trigonometric Methods<br />
<div class="outline-text-5" id="text-4-1-2-1">
<p>
return double always
</p>
<ul class="org-ul">
<li><code>sin(double a);</code></li>

<li><code>cos(double a);</code></li>

<li><code>tan(double a);</code></li>

<li><code>acos(double a);</code></li>

<li><code>asin(double a);</code></li>

<li><code>atan(double a);</code></li>

<li><code>toRadians(double a);</code> // converts to radians</li>

<li><code>toDegrees(double a);</code></li>
</ul>

<hr />
</div>
</li>
<li><a id="org7feb06f"></a>Rounding Methods<br />
<div class="outline-text-5" id="text-4-1-2-2">
<ul class="org-ul">
<li><code>ceil(double x)</code>
x is rounded up to nearest int then returned as double</li>

<li><code>floor(double x)</code>
x is rounded down to nearest int then returned as double</li>

<li><code>rint(double x)</code>
x is returned to the nearest int, if x is equally close to both then the even one is returned as double</li>

<li><code>round(float x)</code>
returns (int)Math.floor(x + 0.5);</li>

<li><code>round(double x)</code>
returns (long)Math.floor(x + 0.5);</li>
</ul>
<div class="org-center">
<p>
NOTE: check examples in slides for Chapter4 page:(8)
</p>
</div>
<hr />
</div>
</li>
<li><a id="org8b74d2c"></a>Exponent Methods<br />
<ol class="org-ol">
<li><a id="org9278d43"></a><span class="todo TODO">TODO</span> Methods<br />
<div class="outline-text-6" id="text-4-1-2-3-1">
<hr />
</div>
</li>
</ol>
</li>
<li><a id="org0b2180b"></a>min, max, abs, and Random Methods<br />
<div class="outline-text-5" id="text-4-1-2-4">
<ul class="org-ul">
<li><code>max(a, b)</code> and <code>min(a, b)</code>
return max or min of the 2 arguments</li>
<li><code>abs(a)</code> returns the absolute value</li>
<li><code>random()</code> returns a random double (from 0.0 to 1.0)</li>
</ul>
<hr />
</div>
</li>
</ol>
</div>
</div>
