ics108.org
*** Special Chars
+ =\b= Backspace
+ =\t= Tab
+ =\n= linefeed
+ =\f= formfeed
+ =\r= carriage return
+ =\\= Backslash = \
+ ="= or =\"= Double Quote
-----
*** Casting between char and ints
#+begin_src java
int i = 'a'; // same as int i = (int)'a';

char a = 97; // same as char c = (char)97;

char ch = 'a';// choose any value

if (ch >= 'A' && ch <= 'Z')
    // uppercase
else if (ch >= 'a' && ch <= 'z')
    // lowercase
else if (ch >= '0' && ch <= '9')
    // number character
#+end_src
-----
*** Character Methods
+ =isLetter()=
+ =isDigit()=
+ =isWhitespace()=
+ =isUpperCase()=
+ =isLowerCase()=
+ =toUpperCase()=
+ =toLowerCase()=
+ =toString()=
-----
** Strings
*** String Length
#+begin_src java
String message = "welcome to java";
int length = message.length(); // String length
#+end_src
Strings are arrays of characters that start at 0
-----
*** specific char from string
#+begin_src java
message.charAt(0); // is 'W'
#+end_src
-----
*** Converting strings
#+begin_src java
"Welcome".toLowerCase(); // returns "welcome"
"Welcome".toUpperCase(); // returns "WELCOME"
"Welcome  ".trim(); // returns "Welcome"
#+end_src
-----
*** String concatenation
#+begin_src java
String s3 = s1.concat(s2);
// or
String s4 = s1 + s2;
// s3 and s4 are string values are equal
boolean bruh = s3.equals(s4); // returns true
#+end_src
-----
