ics108.html
<div id="outline-container-orgf32e7fe" class="outline-3">
<h3 id="orgf32e7fe"><span class="section-number-3">4.2</span> Characters</h3>
<div class="outline-text-3" id="text-4-2">
</div>
<div id="outline-container-orga9c963d" class="outline-4">
<h4 id="orga9c963d"><span class="section-number-4">4.2.1</span> Special Chars</h4>
<div class="outline-text-4" id="text-4-2-1">
<ul class="org-ul">
<li><code>\b</code> Backspace</li>
<li><code>\t</code> Tab</li>
<li><code>\n</code> linefeed</li>
<li><code>\f</code> formfeed</li>
<li><code>\r</code> carriage return</li>
<li><code>\\</code> Backslash = \</li>
<li><code>"</code> or <code>\"</code> Double Quote</li>
</ul>
<hr />
</div>
</div>
<div id="outline-container-org0aa7a53" class="outline-4">
<h4 id="org0aa7a53"><span class="section-number-4">4.2.2</span> Casting between char and ints</h4>
<div class="outline-text-4" id="text-4-2-2">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #5DD8FF;">int</span> <span style="color: #41A1C0;">i</span> = <span style="color: #FC6A5D;">'a'</span>; <span style="color: #6C7986;">// </span><span style="color: #6C7986;">same as int i = (int)'a';</span>

<span style="color: #5DD8FF;">char</span> <span style="color: #41A1C0;">a</span> = <span style="color: #D0BF68; font-weight: bold;">97</span>; <span style="color: #6C7986;">// </span><span style="color: #6C7986;">same as char c = (char)97;</span>

<span style="color: #5DD8FF;">char</span> <span style="color: #41A1C0;">ch</span> = <span style="color: #FC6A5D;">'a'</span>;<span style="color: #6C7986;">// </span><span style="color: #6C7986;">choose any value</span>

<span style="color: #FC5FA3; font-weight: bold;">if</span> <span style="color: #A167E6;">(</span>ch &gt;= <span style="color: #FC6A5D;">'A'</span> &amp;&amp; ch &lt;= <span style="color: #FC6A5D;">'Z'</span><span style="color: #A167E6;">)</span>
    <span style="color: #6C7986;">// </span><span style="color: #6C7986;">uppercase</span>
<span style="color: #FC5FA3; font-weight: bold;">else</span> <span style="color: #FC5FA3; font-weight: bold;">if</span> <span style="color: #A167E6;">(</span>ch &gt;= <span style="color: #FC6A5D;">'a'</span> &amp;&amp; ch &lt;= <span style="color: #FC6A5D;">'z'</span><span style="color: #A167E6;">)</span>
    <span style="color: #6C7986;">// </span><span style="color: #6C7986;">lowercase</span>
<span style="color: #FC5FA3; font-weight: bold;">else</span> <span style="color: #FC5FA3; font-weight: bold;">if</span> <span style="color: #A167E6;">(</span>ch &gt;= <span style="color: #FC6A5D;">'0'</span> &amp;&amp; ch &lt;= <span style="color: #FC6A5D;">'9'</span><span style="color: #A167E6;">)</span>
    <span style="color: #6C7986;">// </span><span style="color: #6C7986;">number character</span>
</pre>
</div>
<hr />
</div>
</div>
<div id="outline-container-org5832c9a" class="outline-4">
<h4 id="org5832c9a"><span class="section-number-4">4.2.3</span> Character Methods</h4>
<div class="outline-text-4" id="text-4-2-3">
<ul class="org-ul">
<li><code>isLetter()</code></li>
<li><code>isDigit()</code></li>
<li><code>isWhitespace()</code></li>
<li><code>isUpperCase()</code></li>
<li><code>isLowerCase()</code></li>
<li><code>toUpperCase()</code></li>
<li><code>toLowerCase()</code></li>
<li><code>toString()</code></li>
</ul>
<hr />
</div>
</div>
</div>
<div id="outline-container-org89ce6f8" class="outline-3">
<h3 id="org89ce6f8"><span class="section-number-3">4.3</span> Strings</h3>
<div class="outline-text-3" id="text-4-3">
</div>
<div id="outline-container-org23d61ff" class="outline-4">
<h4 id="org23d61ff"><span class="section-number-4">4.3.1</span> String Length</h4>
<div class="outline-text-4" id="text-4-3-1">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #5DD8FF;">String</span> <span style="color: #41A1C0;">message</span> = <span style="color: #FC6A5D;">"welcome to java"</span>;
<span style="color: #5DD8FF;">int</span> <span style="color: #41A1C0;">length</span> = message.length<span style="color: #A167E6;">()</span>; <span style="color: #6C7986;">// </span><span style="color: #6C7986;">String length</span>
</pre>
</div>
<p>
Strings are arrays of characters that start at 0
</p>
<hr />
</div>
</div>
<div id="outline-container-org450844a" class="outline-4">
<h4 id="org450844a"><span class="section-number-4">4.3.2</span> specific char from string</h4>
<div class="outline-text-4" id="text-4-3-2">
<div class="org-src-container">
<pre class="src src-java">message.charAt<span style="color: #A167E6;">(</span><span style="color: #D0BF68; font-weight: bold;">0</span><span style="color: #A167E6;">)</span>; <span style="color: #6C7986;">// </span><span style="color: #6C7986;">is 'W'</span>
</pre>
</div>
<hr />
</div>
</div>
<div id="outline-container-org6f779c5" class="outline-4">
<h4 id="org6f779c5"><span class="section-number-4">4.3.3</span> Converting strings</h4>
<div class="outline-text-4" id="text-4-3-3">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #FC6A5D;">"Welcome"</span>.toLowerCase<span style="color: #A167E6;">()</span>; <span style="color: #6C7986;">// </span><span style="color: #6C7986;">returns "welcome"</span>
<span style="color: #FC6A5D;">"Welcome"</span>.toUpperCase<span style="color: #A167E6;">()</span>; <span style="color: #6C7986;">// </span><span style="color: #6C7986;">returns "WELCOME"</span>
<span style="color: #FC6A5D;">"Welcome  "</span>.trim<span style="color: #A167E6;">()</span>; <span style="color: #6C7986;">// </span><span style="color: #6C7986;">returns "Welcome"</span>
</pre>
</div>
<hr />
</div>
</div>
<div id="outline-container-org2f8ec88" class="outline-4">
<h4 id="org2f8ec88"><span class="section-number-4">4.3.4</span> String concatenation</h4>
<div class="outline-text-4" id="text-4-3-4">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #5DD8FF;">String</span> <span style="color: #41A1C0;">s3</span> = s1.concat<span style="color: #A167E6;">(</span>s2<span style="color: #A167E6;">)</span>;
<span style="color: #6C7986;">// </span><span style="color: #6C7986;">or</span>
<span style="color: #5DD8FF;">String</span> <span style="color: #41A1C0;">s4</span> = s1 + s2;
<span style="color: #6C7986;">// </span><span style="color: #6C7986;">s3 and s4 are string values are equal</span>
<span style="color: #5DD8FF;">boolean</span> <span style="color: #41A1C0;">bruh</span> = s3.equals<span style="color: #A167E6;">(</span>s4<span style="color: #A167E6;">)</span>; <span style="color: #6C7986;">// </span><span style="color: #6C7986;">returns true</span>
</pre>
</div>
<hr />
</div>
</div>
