ics108.html
<div id="outline-container-org5a4e93a" class="outline-4">
<h4 id="org5a4e93a"><span class="section-number-4">4.3.5</span> String Methods list</h4>
<div class="outline-text-4" id="text-4-3-5">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Method</th>
<th scope="col" class="org-left">Description</th>
<th scope="col" class="org-left">return type</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>charAt()</code></td>
<td class="org-left">Returns the character at the specified index (position)</td>
<td class="org-left">char</td>
</tr>

<tr>
<td class="org-left"><code>codePointAt()</code></td>
<td class="org-left">Returns the Unicode of the character at the specified index</td>
<td class="org-left">int</td>
</tr>

<tr>
<td class="org-left"><code>codePointBefore()</code></td>
<td class="org-left">Returns the Unicode of the character before the specified index</td>
<td class="org-left">int</td>
</tr>

<tr>
<td class="org-left"><code>codePointCount()</code></td>
<td class="org-left">Returns the Unicode in the specified text range of this String</td>
<td class="org-left">int</td>
</tr>

<tr>
<td class="org-left"><code>compareTo()</code></td>
<td class="org-left">Compares two strings lexicographically</td>
<td class="org-left">int</td>
</tr>

<tr>
<td class="org-left"><code>compareToIgnoreCase()</code></td>
<td class="org-left">Compares two strings lexicographically, ignoring case differences</td>
<td class="org-left">int</td>
</tr>

<tr>
<td class="org-left"><code>concat()</code></td>
<td class="org-left">Appends a string to the end of another string</td>
<td class="org-left">String</td>
</tr>

<tr>
<td class="org-left"><code>contains()</code></td>
<td class="org-left">Checks whether a string contains a sequence of characters</td>
<td class="org-left">boolean</td>
</tr>

<tr>
<td class="org-left"><code>contentEquals()</code></td>
<td class="org-left">Checks whether a string contains the exact same sequence of characters of the specified CharSequence or StringBuffer</td>
<td class="org-left">boolean</td>
</tr>

<tr>
<td class="org-left"><code>copyValueOf()</code></td>
<td class="org-left">Returns a String that represents the characters of the character array</td>
<td class="org-left">String</td>
</tr>

<tr>
<td class="org-left"><code>endsWith()</code></td>
<td class="org-left">Checks whether a string ends with the specified character(s)</td>
<td class="org-left">boolean</td>
</tr>

<tr>
<td class="org-left"><code>equals()</code></td>
<td class="org-left">Compares two strings. Returns true if the strings are equal, and false if not</td>
<td class="org-left">boolean</td>
</tr>

<tr>
<td class="org-left"><code>equalsIgnoreCase()</code></td>
<td class="org-left">Compares two strings, ignoring case considerations</td>
<td class="org-left">boolean</td>
</tr>

<tr>
<td class="org-left"><code>format()</code></td>
<td class="org-left">Returns a formatted string using the specified locale, format string, and arguments</td>
<td class="org-left">String</td>
</tr>

<tr>
<td class="org-left"><code>getBytes()</code></td>
<td class="org-left">Encodes this String into a sequence of bytes using the named charset, storing the result into a new byte array</td>
<td class="org-left">byte[]</td>
</tr>

<tr>
<td class="org-left"><code>getChars()</code></td>
<td class="org-left">Copies characters from a string to an array of chars</td>
<td class="org-left">void</td>
</tr>

<tr>
<td class="org-left"><code>hashCode()</code></td>
<td class="org-left">Returns the hash code of a string</td>
<td class="org-left">int</td>
</tr>

<tr>
<td class="org-left"><code>indexOf()</code></td>
<td class="org-left">Returns the position of the first found occurrence of specified characters in a string</td>
<td class="org-left">int</td>
</tr>

<tr>
<td class="org-left"><code>intern()</code></td>
<td class="org-left">Returns the canonical representation for the string object</td>
<td class="org-left">String</td>
</tr>

<tr>
<td class="org-left"><code>isEmpty()</code></td>
<td class="org-left">Checks whether a string is empty or not</td>
<td class="org-left">boolean</td>
</tr>

<tr>
<td class="org-left"><code>lastIndexOf()</code></td>
<td class="org-left">Returns the position of the last found occurrence of specified characters in a string</td>
<td class="org-left">int</td>
</tr>

<tr>
<td class="org-left"><code>length()</code></td>
<td class="org-left">Returns the length of a specified string</td>
<td class="org-left">int</td>
</tr>

<tr>
<td class="org-left"><code>matches()</code></td>
<td class="org-left">Searches a string for a match against a regular expression, and returns the matches</td>
<td class="org-left">boolean</td>
</tr>

<tr>
<td class="org-left"><code>offsetByCodePoints()</code></td>
<td class="org-left">Returns the index within this String that is offset from the given index by codePointOffset code points</td>
<td class="org-left">int</td>
</tr>

<tr>
<td class="org-left"><code>regionMatches()</code></td>
<td class="org-left">Tests if two string regions are equal</td>
<td class="org-left">boolean</td>
</tr>

<tr>
<td class="org-left"><code>replace()</code></td>
<td class="org-left">Searches a string for a specified value, and returns a new string where the specified values are replaced</td>
<td class="org-left">String</td>
</tr>

<tr>
<td class="org-left"><code>replaceFirst()</code></td>
<td class="org-left">Replaces the first occurrence of a substring that matches the given regular expression with the given replacement</td>
<td class="org-left">String</td>
</tr>

<tr>
<td class="org-left"><code>replaceAll()</code></td>
<td class="org-left">Replaces each substring of this string that matches the given regular expression with the given replacement</td>
<td class="org-left">String</td>
</tr>

<tr>
<td class="org-left"><code>split()</code></td>
<td class="org-left">Splits a string into an array of substrings</td>
<td class="org-left">String[]</td>
</tr>

<tr>
<td class="org-left"><code>startsWith()</code></td>
<td class="org-left">Checks whether a string starts with specified characters</td>
<td class="org-left">boolean</td>
</tr>

<tr>
<td class="org-left"><code>subSequence()</code></td>
<td class="org-left">Returns a new character sequence that is a subsequence of this sequence</td>
<td class="org-left">CharSequence</td>
</tr>

<tr>
<td class="org-left"><code>substring()</code></td>
<td class="org-left">Extracts the characters from a string, beginning at a specified start position, and through the specified number of character</td>
<td class="org-left">String</td>
</tr>

<tr>
<td class="org-left"><code>toCharArray()</code></td>
<td class="org-left">Converts this string to a new character array</td>
<td class="org-left">char[]</td>
</tr>

<tr>
<td class="org-left"><code>toLowerCase()</code></td>
<td class="org-left">Converts a string to lower case letters</td>
<td class="org-left">String</td>
</tr>

<tr>
<td class="org-left"><code>toString()</code></td>
<td class="org-left">Returns the value of a String object</td>
<td class="org-left">String</td>
</tr>

<tr>
<td class="org-left"><code>toUpperCase()</code></td>
<td class="org-left">Converts a string to upper case letters</td>
<td class="org-left">String</td>
</tr>

<tr>
<td class="org-left"><code>trim()</code></td>
<td class="org-left">Removes whitespace from both ends of a string</td>
<td class="org-left">String</td>
</tr>

<tr>
<td class="org-left"><code>valueOf()</code></td>
<td class="org-left">Returns the string representation of the specified value</td>
<td class="org-left">String</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgda9b70b" class="outline-4">
<h4 id="orgda9b70b"><span class="section-number-4">4.3.6</span> Obtaining substrings</h4>
<div class="outline-text-4" id="text-4-3-6">
<ul class="org-ul">
<li><code>substring(int from, int to); // to not included</code></li>
<li><code>indexOf(char ch); gets index of char in string</code></li>
<li><code>substring(int from) gets string from index till end of str</code></li>
</ul>
<hr />
</div>
</div>
