ics108.org
*** Converting between Strings and Numbers
+ =Integer.parseInt(String s); converts string to int=
+ =Double.parseDouble(String s); converts str to double=
-----
** Formatting output
use the printf statement
+ =%b= for boolean value
+ =%c= for char value
+ =%d= for integer 
+ =%f= for floating point number 
+ =%e= for std scientific notation
+ =%s= for string 

#+begin_src java
// System.out.printf(format, items);
String greet = "World!";

System.out.printf("Hello, %s", greet);

#+end_src
-----
* Chapter 5: Loops
    + While loop
      #+begin_src java
      // count digits
      int number = 1000;
      int numdup = 1000;
      int count = 0;
      while (numdup > 0) {
            numdup /= 10;
            count++;
      }
      System.out.println(count);
      #+end_src
    + do while: runs the code in the loop before checking for condition.
      #+begin_src java
      int i = 0;
      do
      {
        System.out.println(i);
        i++
      } while (i < 10); // <- semicolon is here only 
      #+end_src
    + for loop
      #+begin_src java
      //   init ;  condition; update
      for (int i = 0; i < 10; i++) {
        System.out.println("i is " + i);
      }
      #+end_src
      #+begin_src java

      for(char ch: "bruh".toCharArray()) {
        System.out.println(ch);
      }
      #+end_src

-----
* Chapter 6: Methods (functions)
contains of
+ type of method (=public static void=)
if the method returns a specific type then =void= should be replaced with the type
+ Method name (any name for usage)
+ Method parameters (between parentheses)
+ Method collection of statements (code in {})
example:
#+begin_src java
public static int addOne(int number) {
    return number + 1;
}
#+end_src
+ parameters are variables in the method
+ variables initialized in the methods are destroyed after the method is executed
-----
* Chapter 7: Arrays
use arrays to store multiple values to a single variable.
declare array with type int
+ =datatype[] arrayName = new datatype[arraySize];=
#+begin_src java
int[] myArray = new int[10]; // initialize an array
myArray[0] = 0;
myArray[1] = 1;
// etc.
// or another way
int[] myArray2 = {1, 2, 3, 4, 5, 6, 7, 8, 9, 10};
#+end_src
-----
* Chapter 8: Multidimensional Arrays
example
#+begin_src java
int[][] multiArray = new int[10][10];
for (int i = 0; i < multiArray.length; i++) {
    for (int j = 0; j < multiArray[i].length; j++) {
        multiArray[i][j] = 1; // makes every element = 1;
    }
}
// printing an multi dimensional array
for (int i = 0; i < multiArray.length; i++) {
    for (int j = 0; j < multiArray[i].length; j++) {
        System.out.print(multiArray[i][j]);
    }
    System.out.println("");
}
#+end_src

-----
* Chapter 9: Objects and Classes
