ics108.html
<div id="outline-container-org1f35c58" class="outline-4">
<h4 id="org1f35c58"><span class="section-number-4">4.3.7</span> Converting between Strings and Numbers</h4>
<div class="outline-text-4" id="text-4-3-7">
<ul class="org-ul">
<li><code>Integer.parseInt(String s); converts string to int</code></li>
<li><code>Double.parseDouble(String s); converts str to double</code></li>
</ul>
<hr />
</div>
</div>
</div>
<div id="outline-container-orgcd75637" class="outline-3">
<h3 id="orgcd75637"><span class="section-number-3">4.4</span> Formatting output</h3>
<div class="outline-text-3" id="text-4-4">
<p>
use the printf statement
</p>
<ul class="org-ul">
<li><code>%b</code> for boolean value</li>
<li><code>%c</code> for char value</li>
<li><code>%d</code> for integer</li>
<li><code>%f</code> for floating point number</li>
<li><code>%e</code> for std scientific notation</li>
<li><code>%s</code> for string</li>
</ul>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #6C7986;">// </span><span style="color: #6C7986;">System.out.printf(format, items);</span>
<span style="color: #5DD8FF;">String</span> <span style="color: #41A1C0;">greet</span> = <span style="color: #FC6A5D;">"World!"</span>;

System.out.printf<span style="color: #A167E6;">(</span><span style="color: #FC6A5D;">"Hello, %s"</span>, greet<span style="color: #A167E6;">)</span>;

</pre>
</div>
<hr />
</div>
</div>
</div>
<div id="outline-container-org5bba604" class="outline-2">
<h2 id="org5bba604"><span class="section-number-2">5</span> Chapter 5: Loops</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li><p>
While loop
</p>
<div class="org-src-container">
<pre class="src src-java">      <span style="color: #6C7986;">// </span><span style="color: #6C7986;">count digits</span>
      <span style="color: #5DD8FF;">int</span> <span style="color: #41A1C0;">number</span> = <span style="color: #D0BF68; font-weight: bold;">1000</span>;
      <span style="color: #5DD8FF;">int</span> <span style="color: #41A1C0;">numdup</span> = <span style="color: #D0BF68; font-weight: bold;">1000</span>;
      <span style="color: #5DD8FF;">int</span> <span style="color: #41A1C0;">count</span> = <span style="color: #D0BF68; font-weight: bold;">0</span>;
      <span style="color: #FC5FA3; font-weight: bold;">while</span> <span style="color: #A167E6;">(</span>numdup &gt; <span style="color: #D0BF68; font-weight: bold;">0</span><span style="color: #A167E6;">)</span> <span style="color: #A167E6;">{</span>
            numdup /= <span style="color: #D0BF68; font-weight: bold;">10</span>;
            count++;
      <span style="color: #A167E6;">}</span>
      System.out.println<span style="color: #A167E6;">(</span>count<span style="color: #A167E6;">)</span>;
</pre>
</div></li>
<li><p>
do while: runs the code in the loop before checking for condition.
</p>
<div class="org-src-container">
<pre class="src src-java">      <span style="color: #5DD8FF;">int</span> <span style="color: #41A1C0;">i</span> = <span style="color: #D0BF68; font-weight: bold;">0</span>;
      <span style="color: #FC5FA3; font-weight: bold;">do</span>
      <span style="color: #A167E6;">{</span>
        System.out.println<span style="color: #5DD8FF;">(</span>i<span style="color: #5DD8FF;">)</span>;
        i++
      <span style="color: #A167E6;">}</span> <span style="color: #FC5FA3; font-weight: bold;">while</span> <span style="color: #A167E6;">(</span>i &lt; <span style="color: #D0BF68; font-weight: bold;">10</span><span style="color: #A167E6;">)</span>; <span style="color: #6C7986;">// </span><span style="color: #6C7986;">&lt;- semicolon is here only </span>
</pre>
</div></li>
<li><p>
for loop
</p>
<div class="org-src-container">
<pre class="src src-java">      <span style="color: #6C7986;">//   </span><span style="color: #6C7986;">init ;  condition; update</span>
      <span style="color: #FC5FA3; font-weight: bold;">for</span> <span style="color: #A167E6;">(</span><span style="color: #5DD8FF;">int</span> <span style="color: #41A1C0;">i</span> = <span style="color: #D0BF68; font-weight: bold;">0</span>; i &lt; <span style="color: #D0BF68; font-weight: bold;">10</span>; i++<span style="color: #A167E6;">)</span> <span style="color: #A167E6;">{</span>
        System.out.println<span style="color: #5DD8FF;">(</span><span style="color: #FC6A5D;">"i is "</span> + i<span style="color: #5DD8FF;">)</span>;
      <span style="color: #A167E6;">}</span>
</pre>
</div>
<div class="org-src-container">
<pre class="src src-java">
      <span style="color: #FC5FA3; font-weight: bold;">for</span><span style="color: #A167E6;">(</span><span style="color: #5DD8FF;">char</span> <span style="color: #41A1C0;">ch</span>: <span style="color: #FC6A5D;">"bruh"</span>.toCharArray<span style="color: #5DD8FF;">()</span><span style="color: #A167E6;">)</span> <span style="color: #A167E6;">{</span>
        System.out.println<span style="color: #5DD8FF;">(</span>ch<span style="color: #5DD8FF;">)</span>;
      <span style="color: #A167E6;">}</span>
</pre>
</div></li>
</ul>

<hr />
</div>
</div>
<div id="outline-container-org8c16b9e" class="outline-2">
<h2 id="org8c16b9e"><span class="section-number-2">6</span> Chapter 6: Methods (functions)</h2>
<div class="outline-text-2" id="text-6">
<p>
contains of
</p>
<ul class="org-ul">
<li>type of method (<code>public static void</code>)</li>
</ul>
<p>
if the method returns a specific type then <code>void</code> should be replaced with the type
</p>
<ul class="org-ul">
<li>Method name (any name for usage)</li>
<li>Method parameters (between parentheses)</li>
<li>Method collection of statements (code in {})</li>
</ul>
<p>
example:
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #FC5FA3; font-weight: bold;">public</span> <span style="color: #FC5FA3; font-weight: bold;">static</span> <span style="color: #5DD8FF;">int</span> <span style="color: #41A1C0;">addOne</span><span style="color: #A167E6;">(</span><span style="color: #5DD8FF;">int</span> <span style="color: #41A1C0;">number</span><span style="color: #A167E6;">)</span> <span style="color: #A167E6;">{</span>
    <span style="color: #FC5FA3; font-weight: bold;">return</span> number + <span style="color: #D0BF68; font-weight: bold;">1</span>;
<span style="color: #A167E6;">}</span>
</pre>
</div>
<ul class="org-ul">
<li>parameters are variables in the method</li>
<li>variables initialized in the methods are destroyed after the method is executed</li>
</ul>
<hr />
</div>
</div>
<div id="outline-container-orgc2b1c49" class="outline-2">
<h2 id="orgc2b1c49"><span class="section-number-2">7</span> Chapter 7: Arrays</h2>
<div class="outline-text-2" id="text-7">
<p>
use arrays to store multiple values to a single variable.
declare array with type int
</p>
<ul class="org-ul">
<li><code>datatype[] arrayName = new datatype[arraySize];</code></li>
</ul>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #5DD8FF;">int</span><span style="color: #A167E6;">[]</span> <span style="color: #41A1C0;">myArray</span> = <span style="color: #FC5FA3; font-weight: bold;">new</span> <span style="color: #5DD8FF;">int</span><span style="color: #A167E6;">[</span><span style="color: #D0BF68; font-weight: bold;">10</span><span style="color: #A167E6;">]</span>; <span style="color: #6C7986;">// </span><span style="color: #6C7986;">initialize an array</span>
myArray<span style="color: #A167E6;">[</span><span style="color: #D0BF68; font-weight: bold;">0</span><span style="color: #A167E6;">]</span> = <span style="color: #D0BF68; font-weight: bold;">0</span>;
myArray<span style="color: #A167E6;">[</span><span style="color: #D0BF68; font-weight: bold;">1</span><span style="color: #A167E6;">]</span> = <span style="color: #D0BF68; font-weight: bold;">1</span>;
<span style="color: #6C7986;">// </span><span style="color: #6C7986;">etc.</span>
<span style="color: #6C7986;">// </span><span style="color: #6C7986;">or another way</span>
<span style="color: #5DD8FF;">int</span><span style="color: #A167E6;">[]</span> <span style="color: #41A1C0;">myArray2</span> = <span style="color: #A167E6;">{</span><span style="color: #D0BF68; font-weight: bold;">1</span>, <span style="color: #D0BF68; font-weight: bold;">2</span>, <span style="color: #D0BF68; font-weight: bold;">3</span>, <span style="color: #D0BF68; font-weight: bold;">4</span>, <span style="color: #D0BF68; font-weight: bold;">5</span>, <span style="color: #D0BF68; font-weight: bold;">6</span>, <span style="color: #D0BF68; font-weight: bold;">7</span>, <span style="color: #D0BF68; font-weight: bold;">8</span>, <span style="color: #D0BF68; font-weight: bold;">9</span>, <span style="color: #D0BF68; font-weight: bold;">10</span><span style="color: #A167E6;">}</span>;
</pre>
</div>
<hr />
</div>
</div>
<div id="outline-container-org425d5d2" class="outline-2">
<h2 id="org425d5d2"><span class="section-number-2">8</span> Chapter 8: Multidimensional Arrays</h2>
<div class="outline-text-2" id="text-8">
<p>
example
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #5DD8FF;">int</span><span style="color: #A167E6;">[][]</span> <span style="color: #41A1C0;">multiArray</span> = <span style="color: #FC5FA3; font-weight: bold;">new</span> <span style="color: #5DD8FF;">int</span><span style="color: #A167E6;">[</span><span style="color: #D0BF68; font-weight: bold;">10</span><span style="color: #A167E6;">][</span><span style="color: #D0BF68; font-weight: bold;">10</span><span style="color: #A167E6;">]</span>;
<span style="color: #FC5FA3; font-weight: bold;">for</span> <span style="color: #A167E6;">(</span><span style="color: #5DD8FF;">int</span> <span style="color: #41A1C0;">i</span> = <span style="color: #D0BF68; font-weight: bold;">0</span>; i &lt; multiArray.<span style="color: #5DD8FF;">length</span>; i++<span style="color: #A167E6;">)</span> <span style="color: #A167E6;">{</span>
    <span style="color: #FC5FA3; font-weight: bold;">for</span> <span style="color: #5DD8FF;">(</span><span style="color: #5DD8FF;">int</span> <span style="color: #41A1C0;">j</span> = <span style="color: #D0BF68; font-weight: bold;">0</span>; j &lt; <span style="color: #5DD8FF;">multiArray</span><span style="color: #FD8F3F;">[</span>i<span style="color: #FD8F3F;">]</span>.length; j++<span style="color: #5DD8FF;">)</span> <span style="color: #5DD8FF;">{</span>
        multiArray<span style="color: #FD8F3F;">[</span>i<span style="color: #FD8F3F;">][</span>j<span style="color: #FD8F3F;">]</span> = <span style="color: #D0BF68; font-weight: bold;">1</span>; <span style="color: #6C7986;">// </span><span style="color: #6C7986;">makes every element = 1;</span>
    <span style="color: #5DD8FF;">}</span>
<span style="color: #A167E6;">}</span>
<span style="color: #6C7986;">// </span><span style="color: #6C7986;">printing an multi dimensional array</span>
<span style="color: #FC5FA3; font-weight: bold;">for</span> <span style="color: #A167E6;">(</span><span style="color: #5DD8FF;">int</span> <span style="color: #41A1C0;">i</span> = <span style="color: #D0BF68; font-weight: bold;">0</span>; i &lt; multiArray.<span style="color: #5DD8FF;">length</span>; i++<span style="color: #A167E6;">)</span> <span style="color: #A167E6;">{</span>
    <span style="color: #FC5FA3; font-weight: bold;">for</span> <span style="color: #5DD8FF;">(</span><span style="color: #5DD8FF;">int</span> <span style="color: #41A1C0;">j</span> = <span style="color: #D0BF68; font-weight: bold;">0</span>; j &lt; <span style="color: #5DD8FF;">multiArray</span><span style="color: #FD8F3F;">[</span>i<span style="color: #FD8F3F;">]</span>.length; j++<span style="color: #5DD8FF;">)</span> <span style="color: #5DD8FF;">{</span>
        System.out.print<span style="color: #FD8F3F;">(</span>multiArray<span style="color: #67B7A4;">[</span>i<span style="color: #67B7A4;">][</span>j<span style="color: #67B7A4;">]</span><span style="color: #FD8F3F;">)</span>;
    <span style="color: #5DD8FF;">}</span>
    System.out.println<span style="color: #5DD8FF;">(</span><span style="color: #FC6A5D;">""</span><span style="color: #5DD8FF;">)</span>;
<span style="color: #A167E6;">}</span>
</pre>
</div>

<hr />
</div>
</div>
<div id="outline-container-orge89df6b" class="outline-2">
<h2 id="orge89df6b"><span class="section-number-2">9</span> Chapter 9: Objects and Classes</h2>
<div class="outline-text-2" id="text-9">
</div>
