ics108.org
** Basic info
they help in large-scale software and graphical user interfaces software systems

#+begin_src java
// minimal example
class Circle {
    int radius; // NOTE it is recommended to make it private
}
// running app
class App {
    public static void main(String[] args) {
        Circle circle = new Circle();
        circle.radius = 1;
        System.out.println(circle.radius);
    }
}
#+end_src
-----
** Constructors

+ better way of initializing variables in classes
+ Must have the same name as classes
+ Do not return values not even void
+ Constructor are invoked with new operator
+ Are used for initializing objects
+ =new= operator is used for initializing

#+begin_src java
class Circle {
    int radius;

    // a default Constructor
    // if no values are passed
    public Circle() {
        this.radius = 1;
    }

    // constructor used when one int is passed
    public Circle(int radius) {
        this.radius = radius;
    }
}

class App {
    public static void main(String[] args) {
        // initialize a new class
        // `new` keyword is used
        Circle circle = new Circle(2);
        // ^ Class name
        //       ^^ Class ref var name
        //               ^^ new class of type circle
        // and with `2` as argument
        System.out.println(circle.radius);
    }
}
#+end_src
-----
** Reference data fields
variables in class have default values if not initialized
+ String will have =null=
+ int will be =0=
+ boolean will be =false=
+ char will have ='\u0000'=
#+begin_center
Java assigns no default value to local variables inside a method
#+end_center
-----
** Garbage collection
assign the class to null to tell the Java virtual machine to free the object from memory

-----
** Instance variables and methods
+ instance variable belong to a specific instance
+ instance methods are invoked by an instance of the class

-----
** Static variables, constants, and methods
use =static= modifier to convert the var, const and method to static 
+ Static variables are shared by all the instances of the class.
+ Static methods are not tied to a specific object. 
+ Static constants are final variables shared by all the instances of the class.

-----
** Visiblity Modifiers and Accessor/Mutator Methods
by default the class, variable or method can be accessed by any class in the same package

-----
*** public keyword
+ the class, data or method is accessable to any class or package 
-----
*** private keyword
+ the data or method is only accessable by declaring a variable
+ use get and set Methods to access private data
-----
