ics108.html
<div id="outline-container-org95150b6" class="outline-3">
<h3 id="org95150b6"><span class="section-number-3">9.1</span> Basic info</h3>
<div class="outline-text-3" id="text-9-1">
<p>
they help in large-scale software and graphical user interfaces software systems
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #6C7986;">// </span><span style="color: #6C7986;">minimal example</span>
<span style="color: #FC5FA3; font-weight: bold;">class</span> <span style="color: #5DD8FF;">Circle</span> <span style="color: #A167E6;">{</span>
    <span style="color: #5DD8FF;">int</span> <span style="color: #41A1C0;">radius</span>; <span style="color: #6C7986;">// </span><span style="color: #67B7A4; font-weight: bold;">NOTE</span><span style="color: #6C7986;"> it is recommended to make it private</span>
<span style="color: #A167E6;">}</span>
<span style="color: #6C7986;">// </span><span style="color: #6C7986;">running app</span>
<span style="color: #FC5FA3; font-weight: bold;">class</span> <span style="color: #5DD8FF;">App</span> <span style="color: #A167E6;">{</span>
    <span style="color: #FC5FA3; font-weight: bold;">public</span> <span style="color: #FC5FA3; font-weight: bold;">static</span> <span style="color: #5DD8FF;">void</span> <span style="color: #41A1C0;">main</span><span style="color: #5DD8FF;">(</span><span style="color: #5DD8FF;">String</span><span style="color: #FD8F3F;">[]</span> <span style="color: #41A1C0;">args</span><span style="color: #5DD8FF;">)</span> <span style="color: #5DD8FF;">{</span>
        <span style="color: #5DD8FF;">Circle</span> <span style="color: #41A1C0;">circle</span> = <span style="color: #FC5FA3; font-weight: bold;">new</span> <span style="color: #5DD8FF;">Circle</span><span style="color: #FD8F3F;">()</span>;
        circle.radius = <span style="color: #D0BF68; font-weight: bold;">1</span>;
        System.out.println<span style="color: #FD8F3F;">(</span>circle.radius<span style="color: #FD8F3F;">)</span>;
    <span style="color: #5DD8FF;">}</span>
<span style="color: #A167E6;">}</span>
</pre>
</div>
<hr />
</div>
</div>
<div id="outline-container-orgb6fda8a" class="outline-3">
<h3 id="orgb6fda8a"><span class="section-number-3">9.2</span> Constructors</h3>
<div class="outline-text-3" id="text-9-2">
<ul class="org-ul">
<li>better way of initializing variables in classes</li>
<li>Must have the same name as classes</li>
<li>Do not return values not even void</li>
<li>Constructor are invoked with new operator</li>
<li>Are used for initializing objects</li>
<li><code>new</code> operator is used for initializing</li>
</ul>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #FC5FA3; font-weight: bold;">class</span> <span style="color: #5DD8FF;">Circle</span> <span style="color: #A167E6;">{</span>
    <span style="color: #5DD8FF;">int</span> <span style="color: #41A1C0;">radius</span>;

    <span style="color: #6C7986;">// </span><span style="color: #6C7986;">a default Constructor</span>
    <span style="color: #6C7986;">// </span><span style="color: #6C7986;">if no values are passed</span>
    <span style="color: #FC5FA3; font-weight: bold;">public</span> <span style="color: #41A1C0;">Circle</span><span style="color: #5DD8FF;">()</span> <span style="color: #5DD8FF;">{</span>
        <span style="color: #FC5FA3; font-weight: bold;">this</span>.radius = <span style="color: #D0BF68; font-weight: bold;">1</span>;
    <span style="color: #5DD8FF;">}</span>

    <span style="color: #6C7986;">// </span><span style="color: #6C7986;">constructor used when one int is passed</span>
    <span style="color: #FC5FA3; font-weight: bold;">public</span> <span style="color: #41A1C0;">Circle</span><span style="color: #5DD8FF;">(</span><span style="color: #5DD8FF;">int</span> <span style="color: #41A1C0;">radius</span><span style="color: #5DD8FF;">)</span> <span style="color: #5DD8FF;">{</span>
        <span style="color: #FC5FA3; font-weight: bold;">this</span>.radius = radius;
    <span style="color: #5DD8FF;">}</span>
<span style="color: #A167E6;">}</span>

<span style="color: #FC5FA3; font-weight: bold;">class</span> <span style="color: #5DD8FF;">App</span> <span style="color: #A167E6;">{</span>
    <span style="color: #FC5FA3; font-weight: bold;">public</span> <span style="color: #FC5FA3; font-weight: bold;">static</span> <span style="color: #5DD8FF;">void</span> <span style="color: #41A1C0;">main</span><span style="color: #5DD8FF;">(</span><span style="color: #5DD8FF;">String</span><span style="color: #FD8F3F;">[]</span> <span style="color: #41A1C0;">args</span><span style="color: #5DD8FF;">)</span> <span style="color: #5DD8FF;">{</span>
        <span style="color: #6C7986;">// </span><span style="color: #6C7986;">initialize a new class</span>
        <span style="color: #6C7986;">// </span><span style="color: #6C7986;">`new` keyword is used</span>
        <span style="color: #5DD8FF;">Circle</span> <span style="color: #41A1C0;">circle</span> = <span style="color: #FC5FA3; font-weight: bold;">new</span> <span style="color: #5DD8FF;">Circle</span><span style="color: #FD8F3F;">(</span><span style="color: #D0BF68; font-weight: bold;">2</span><span style="color: #FD8F3F;">)</span>;
        <span style="color: #6C7986;">// </span><span style="color: #6C7986;">^ Class name</span>
        <span style="color: #6C7986;">//       </span><span style="color: #6C7986;">^^ Class ref var name</span>
        <span style="color: #6C7986;">//               </span><span style="color: #6C7986;">^^ new class of type circle</span>
        <span style="color: #6C7986;">// </span><span style="color: #6C7986;">and with `2` as argument</span>
        System.out.println<span style="color: #FD8F3F;">(</span>circle.radius<span style="color: #FD8F3F;">)</span>;
    <span style="color: #5DD8FF;">}</span>
<span style="color: #A167E6;">}</span>
</pre>
</div>
<hr />
</div>
</div>
<div id="outline-container-org56348f9" class="outline-3">
<h3 id="org56348f9"><span class="section-number-3">9.3</span> Reference data fields</h3>
<div class="outline-text-3" id="text-9-3">
<p>
variables in class have default values if not initialized
</p>
<ul class="org-ul">
<li>String will have <code>null</code></li>
<li>int will be <code>0</code></li>
<li>boolean will be <code>false</code></li>
<li>char will have <code>'\u0000'</code></li>
</ul>
<div class="org-center">
<p>
Java assigns no default value to local variables inside a method
</p>
</div>
<hr />
</div>
</div>
<div id="outline-container-org86713d0" class="outline-3">
<h3 id="org86713d0"><span class="section-number-3">9.4</span> Garbage collection</h3>
<div class="outline-text-3" id="text-9-4">
<p>
assign the class to null to tell the Java virtual machine to free the object from memory
</p>

<hr />
</div>
</div>
<div id="outline-container-org84196bb" class="outline-3">
<h3 id="org84196bb"><span class="section-number-3">9.5</span> Instance variables and methods</h3>
<div class="outline-text-3" id="text-9-5">
<ul class="org-ul">
<li>instance variable belong to a specific instance</li>
<li>instance methods are invoked by an instance of the class</li>
</ul>

<hr />
</div>
</div>
<div id="outline-container-orgcda2215" class="outline-3">
<h3 id="orgcda2215"><span class="section-number-3">9.6</span> Static variables, constants, and methods</h3>
<div class="outline-text-3" id="text-9-6">
<p>
use <code>static</code> modifier to convert the var, const and method to static 
</p>
<ul class="org-ul">
<li>Static variables are shared by all the instances of the class.</li>
<li>Static methods are not tied to a specific object.</li>
<li>Static constants are final variables shared by all the instances of the class.</li>
</ul>

<hr />
</div>
</div>
<div id="outline-container-org5e5496c" class="outline-3">
<h3 id="org5e5496c"><span class="section-number-3">9.7</span> Visiblity Modifiers and Accessor/Mutator Methods</h3>
<div class="outline-text-3" id="text-9-7">
<p>
by default the class, variable or method can be accessed by any class in the same package
</p>

<hr />
</div>
<div id="outline-container-org9d12475" class="outline-4">
<h4 id="org9d12475"><span class="section-number-4">9.7.1</span> public keyword</h4>
<div class="outline-text-4" id="text-9-7-1">
<ul class="org-ul">
<li>the class, data or method is accessable to any class or package</li>
</ul>
<hr />
</div>
</div>
<div id="outline-container-org1209034" class="outline-4">
<h4 id="org1209034"><span class="section-number-4">9.7.2</span> private keyword</h4>
<div class="outline-text-4" id="text-9-7-2">
<ul class="org-ul">
<li>the data or method is only accessable by declaring a variable</li>
<li>use get and set Methods to access private data</li>
</ul>
<hr />
</div>
</div>
