ics108.org
***  Examples
C1.java
#+name: C1.java
#+begin_src java
package p1;

public class C1 {
    public int x;
    int y;
    private int z; // NOTE: only usable within the class
    // NOTE: private data fields
    // are used to protect data
    // and make code easier to maintain

    public void m1() {
    }

    void m2() {
    }

    private void m3(){
    }
}
#+end_src
C2.java
#+name: C2.java
#+begin_src java
package p1;

public class C2 {
    void aMethod() {
        C1 o = new C1();
        // can access o.x and o.y
        // cannot access o.z
        // can invoke o.m1(); and o.m2();
        // cannot invoke o.m3();
    }
}
#+end_src
C3.java
#+name: C3.java
#+begin_src java
package p2; // notice it is a different package

public class C3 {
    void aMethod() {
        C1 o = new C1();
        // can access o.x only;
        // cannot access o.y and o.z;

        // can invoke o.m1();
        // cannot invoke o.m2() and o.m3()
    }
}
#+end_src
-----
examples for classes

C1.java
#+name: C1.java
#+begin_src java
package p1;

class C1 {
    // whatever
}
#+end_src
C2.java
#+name: C2.java
#+begin_src java
package p1;

public class C2 {
    // can access C1
}
#+end_src
C3.java
#+name: C3.java
#+begin_src java
package p2; // notice the pkg name

public class C3 {
    // cannot access C1
    // can access C2
}
#+end_src
-----
** Immutable objects and classes
to create an immutable class, the data fields must be =private= and provide no mutator and no accessor methods such as getters or setters
-----
** this keyword
=this= is used to refer to class's hidden data fields

example
#+begin_src java
class Bruh {
    private String value;

    public Bruh(String value) {
        this.value = value;
        // this.value is the String variable in the object
        // value from obj = value passed from argument
    }
}
#+end_src
-----

* TODO Chapter 10: objects (review the book)
#+begin_quote
review the book
#+end_quote
-----

* TODO Chapter 11: inheritance and polymorphism
+ =super= keyword is used
  #+begin_quote
  check the book
  #+end_quote
