ics108.html
<div id="outline-container-org25825d0" class="outline-4">
<h4 id="org25825d0"><span class="section-number-4">9.7.3</span> Examples</h4>
<div class="outline-text-4" id="text-9-7-3">
<p>
C1.java
</p>
<div class="org-src-container">
<pre class="src src-java" id="orgec73147"><span style="color: #FC5FA3; font-weight: bold;">package</span> <span style="color: #A167E6;">p1</span>;

<span style="color: #FC5FA3; font-weight: bold;">public</span> <span style="color: #FC5FA3; font-weight: bold;">class</span> <span style="color: #5DD8FF;">C1</span> <span style="color: #A167E6;">{</span>
    <span style="color: #FC5FA3; font-weight: bold;">public</span> <span style="color: #5DD8FF;">int</span> <span style="color: #41A1C0;">x</span>;
    <span style="color: #5DD8FF;">int</span> <span style="color: #41A1C0;">y</span>;
    <span style="color: #FC5FA3; font-weight: bold;">private</span> <span style="color: #5DD8FF;">int</span> <span style="color: #41A1C0;">z</span>; <span style="color: #6C7986;">// </span><span style="color: #67B7A4; font-weight: bold;">NOTE:</span><span style="color: #6C7986;"> only usable within the class</span>
    <span style="color: #6C7986;">// </span><span style="color: #67B7A4; font-weight: bold;">NOTE:</span><span style="color: #6C7986;"> private data fields</span>
    <span style="color: #6C7986;">// </span><span style="color: #6C7986;">are used to protect data</span>
    <span style="color: #6C7986;">// </span><span style="color: #6C7986;">and make code easier to maintain</span>

    <span style="color: #FC5FA3; font-weight: bold;">public</span> <span style="color: #5DD8FF;">void</span> <span style="color: #41A1C0;">m1</span><span style="color: #5DD8FF;">()</span> <span style="color: #5DD8FF;">{</span>
    <span style="color: #5DD8FF;">}</span>

    <span style="color: #5DD8FF;">void</span> <span style="color: #41A1C0;">m2</span><span style="color: #5DD8FF;">()</span> <span style="color: #5DD8FF;">{</span>
    <span style="color: #5DD8FF;">}</span>

    <span style="color: #FC5FA3; font-weight: bold;">private</span> <span style="color: #5DD8FF;">void</span> <span style="color: #41A1C0;">m3</span><span style="color: #5DD8FF;">(){</span>
    <span style="color: #5DD8FF;">}</span>
<span style="color: #A167E6;">}</span>
</pre>
</div>
<p>
C2.java
</p>
<div class="org-src-container">
<pre class="src src-java" id="org6819393"><span style="color: #FC5FA3; font-weight: bold;">package</span> <span style="color: #A167E6;">p1</span>;

<span style="color: #FC5FA3; font-weight: bold;">public</span> <span style="color: #FC5FA3; font-weight: bold;">class</span> <span style="color: #5DD8FF;">C2</span> <span style="color: #A167E6;">{</span>
    <span style="color: #5DD8FF;">void</span> <span style="color: #41A1C0;">aMethod</span><span style="color: #5DD8FF;">()</span> <span style="color: #5DD8FF;">{</span>
        <span style="color: #5DD8FF;">C1</span> <span style="color: #41A1C0;">o</span> = <span style="color: #FC5FA3; font-weight: bold;">new</span> <span style="color: #5DD8FF;">C1</span><span style="color: #FD8F3F;">()</span>;
        <span style="color: #6C7986;">// </span><span style="color: #6C7986;">can access o.x and o.y</span>
        <span style="color: #6C7986;">// </span><span style="color: #6C7986;">cannot access o.z</span>
        <span style="color: #6C7986;">// </span><span style="color: #6C7986;">can invoke o.m1(); and o.m2();</span>
        <span style="color: #6C7986;">// </span><span style="color: #6C7986;">cannot invoke o.m3();</span>
    <span style="color: #5DD8FF;">}</span>
<span style="color: #A167E6;">}</span>
</pre>
</div>
<p>
C3.java
</p>
<div class="org-src-container">
<pre class="src src-java" id="org08a1326"><span style="color: #FC5FA3; font-weight: bold;">package</span> <span style="color: #A167E6;">p2</span>; <span style="color: #6C7986;">// </span><span style="color: #6C7986;">notice it is a different package</span>

<span style="color: #FC5FA3; font-weight: bold;">public</span> <span style="color: #FC5FA3; font-weight: bold;">class</span> <span style="color: #5DD8FF;">C3</span> <span style="color: #A167E6;">{</span>
    <span style="color: #5DD8FF;">void</span> <span style="color: #41A1C0;">aMethod</span><span style="color: #5DD8FF;">()</span> <span style="color: #5DD8FF;">{</span>
        <span style="color: #5DD8FF;">C1</span> <span style="color: #41A1C0;">o</span> = <span style="color: #FC5FA3; font-weight: bold;">new</span> <span style="color: #5DD8FF;">C1</span><span style="color: #FD8F3F;">()</span>;
        <span style="color: #6C7986;">// </span><span style="color: #6C7986;">can access o.x only;</span>
        <span style="color: #6C7986;">// </span><span style="color: #6C7986;">cannot access o.y and o.z;</span>

        <span style="color: #6C7986;">// </span><span style="color: #6C7986;">can invoke o.m1();</span>
        <span style="color: #6C7986;">// </span><span style="color: #6C7986;">cannot invoke o.m2() and o.m3()</span>
    <span style="color: #5DD8FF;">}</span>
<span style="color: #A167E6;">}</span>
</pre>
</div>
<hr />
<p>
examples for classes
</p>

<p>
C1.java
</p>
<div class="org-src-container">
<pre class="src src-java" id="org04c958d"><span style="color: #FC5FA3; font-weight: bold;">package</span> <span style="color: #A167E6;">p1</span>;

<span style="color: #FC5FA3; font-weight: bold;">class</span> <span style="color: #5DD8FF;">C1</span> <span style="color: #A167E6;">{</span>
    <span style="color: #6C7986;">// </span><span style="color: #6C7986;">whatever</span>
<span style="color: #A167E6;">}</span>
</pre>
</div>
<p>
C2.java
</p>
<div class="org-src-container">
<pre class="src src-java" id="orgb243e8d"><span style="color: #FC5FA3; font-weight: bold;">package</span> <span style="color: #A167E6;">p1</span>;

<span style="color: #FC5FA3; font-weight: bold;">public</span> <span style="color: #FC5FA3; font-weight: bold;">class</span> <span style="color: #5DD8FF;">C2</span> <span style="color: #A167E6;">{</span>
    <span style="color: #6C7986;">// </span><span style="color: #6C7986;">can access C1</span>
<span style="color: #A167E6;">}</span>
</pre>
</div>
<p>
C3.java
</p>
<div class="org-src-container">
<pre class="src src-java" id="org7dedfd3"><span style="color: #FC5FA3; font-weight: bold;">package</span> <span style="color: #A167E6;">p2</span>; <span style="color: #6C7986;">// </span><span style="color: #6C7986;">notice the pkg name</span>

<span style="color: #FC5FA3; font-weight: bold;">public</span> <span style="color: #FC5FA3; font-weight: bold;">class</span> <span style="color: #5DD8FF;">C3</span> <span style="color: #A167E6;">{</span>
    <span style="color: #6C7986;">// </span><span style="color: #6C7986;">cannot access C1</span>
    <span style="color: #6C7986;">// </span><span style="color: #6C7986;">can access C2</span>
<span style="color: #A167E6;">}</span>
</pre>
</div>
<hr />
</div>
</div>
</div>
<div id="outline-container-orgf076b11" class="outline-3">
<h3 id="orgf076b11"><span class="section-number-3">9.8</span> Immutable objects and classes</h3>
<div class="outline-text-3" id="text-9-8">
<p>
to create an immutable class, the data fields must be <code>private</code> and provide no mutator and no accessor methods such as getters or setters
</p>
<hr />
</div>
</div>
<div id="outline-container-org682adb3" class="outline-3">
<h3 id="org682adb3"><span class="section-number-3">9.9</span> this keyword</h3>
<div class="outline-text-3" id="text-9-9">
<p>
<code>this</code> is used to refer to class&rsquo;s hidden data fields
</p>

<p>
example
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #FC5FA3; font-weight: bold;">class</span> <span style="color: #5DD8FF;">Bruh</span> <span style="color: #A167E6;">{</span>
    <span style="color: #FC5FA3; font-weight: bold;">private</span> <span style="color: #5DD8FF;">String</span> <span style="color: #41A1C0;">value</span>;

    <span style="color: #FC5FA3; font-weight: bold;">public</span> <span style="color: #41A1C0;">Bruh</span><span style="color: #5DD8FF;">(</span><span style="color: #5DD8FF;">String</span> <span style="color: #41A1C0;">value</span><span style="color: #5DD8FF;">)</span> <span style="color: #5DD8FF;">{</span>
        <span style="color: #FC5FA3; font-weight: bold;">this</span>.value = value;
        <span style="color: #6C7986;">// </span><span style="color: #6C7986;">this.value is the String variable in the object</span>
        <span style="color: #6C7986;">// </span><span style="color: #6C7986;">value from obj = value passed from argument</span>
    <span style="color: #5DD8FF;">}</span>
<span style="color: #A167E6;">}</span>
</pre>
</div>
<hr />
</div>
</div>
</div>

<div id="outline-container-org3e4238e" class="outline-2">
<h2 id="org3e4238e"><span class="section-number-2">10</span> <span class="todo TODO">TODO</span> Chapter 10: objects (review the book)</h2>
<div class="outline-text-2" id="text-10">
<blockquote>
<p>
review the book
</p>
</blockquote>
<hr />
</div>
</div>

<div id="outline-container-org76c1868" class="outline-2">
<h2 id="org76c1868"><span class="section-number-2">11</span> <span class="todo TODO">TODO</span> Chapter 11: inheritance and polymorphism</h2>
<div class="outline-text-2" id="text-11">
<ul class="org-ul">
<li><p>
<code>super</code> keyword is used
</p>
<blockquote>
<p>
check the book
</p>
</blockquote></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Airbus5717</p>
<p class="date">Created: 2021-07-03 Sat 18:00</p>
</div>
</body>
</html>
